{
  "data": [
    {
      "title": "Tohle je Iris",
      "subheading": "Pohled do nové éry grafiky Minecraftu",
      "or": "nebo",
      "continue": "Pokračovat ve čtení",
      "heading1": "Proč Iris?",
      "subheading1": "Tohle dělá Iris výjmečným",
      "card1": "Kompatibilita s módy",
      "carddesc1": "Iris má zajištění kompatibility s módy jako hlavní prioritu a je již kompatibilní se spoustou vašich oblíbených módů!",
      "card2": "Moderní design",
      "carddesc2": "Iris byl od základu vytvořen tak, aby byl rozšiřitelný a snadno aktualizovatelný. Rozlučte se s týdny čekání na použití shaderů v nové verzi Minecraftu!",
      "card3": "Zdarma a Open Source",
      "carddesc3": "Iris je open source mód, do kterého může kdokoli přispívat. To umožňuje zlepšování Irisu díky usnadnění spolupráce.",
      "heading2": "Funkce",
      "subheading2": "Co může Iris nabídnout",
      "image1": "Stejné jako OptiFine",
      "imagedesc1": "Iris se snaží mít plnou podporu pro všechny minulé i současné balíčky shaderů OptiFine a počet balíčků podporovaných Irisem neustále rychle roste!<span class='text-span-2'><br>Vyfotil IMS</span>",
      "image2": "Funguje se Sodium",
      "imagedesc2": "Iris je kompatibilní s optimalizačními módy CaffeineMC jako je Sodium a Phosphor, což umožňuje úžasnou grafiku se stejnou nebo dokonce vyšší snímkovou frekvencí než ve vanille.<br><span class='text-span-2'>Vyfotil IMS</span>",
      "heading3": "Výhoda Iris",
      "subheading3": "Nové způsoby vykreslování, díky kterým budete vždy o krok dále před hrou",
      "shadows": "Stíny",
      "entities": "Entinty",
      "screenshottitle1": "Optimalizované stíny",
      "screenshotdesc1": "Iris používá techniku s názvem Shadow Frustum Culling pro snížení dopadu největšího žrouta výkonu shaderu - stínů. Pomocí této funkce budete moci dosáhnout vyšších snímkových frekvencí bez snížení kvality volumetrického světla nebo stínů.<br><span class='text-span-2'>Vyfotil IMS, Kappa v5</span>",
      "screenshottitle2": "Efektivní renderování entit",
      "screenshotdesc2": "Iris zlepšuje způsob, jakým Minecraft renderuje entity a blokové entity jako truhly, prasata a rámečky. Tento trik funguje i se zakázanými shadery a ve světech s velkým počtem entit, může zvýšit vanilla výkon až o 60 procent. Velkého zlepšení se dočkalo hlavně vykreslování stínů, díky čemuž jsou oblasti, které byly dříve se shadery nehratelné, nyní plynulé!<br><span class='text-span-2'>Vyfotil kinzuu_music</span>",
      "stillcurious": "Stále jste zvědaví? <a href='about.html'>Zjistěte více</a><link rel='prefetch' href='/about.html'>."
    },
    {
      "abouttitle": "O projektu IrisShaders",
      "heading": "Projekt Iris",
      "subheading": "Zjistěte více o shaderové senzaci",
      "aboutproject": "O projektu",
      "messageheading": "Zpráva od zakladatele a hlavního vývojáře Iris Shaders",
      "message": "Iris byl vytvořen pro zaplnění díry, kterou jsem viděl v komunitě přizpůsobení a grafického zlepšení Minecraftu: chybějící open-source mód na shadery, který by mi umožnil načíst mé oblíbené balíčky shaderů na moderních verzích hry, se zachováním výkonu a kompatibility s modpacky. OptiFine, současný dominantní mód pro načítání balíčků shaderů, má restriktivní licenci, která stojí v cestě jakémukoli způsobu úpravy, a je nechvalně známý díky problémům s kompatibilitou s módy, které mám rád. Také je nekompatibilní se Sodiem, s velkým náskokem nejlepším módem na optimalizaci vykreslování hry. ShadersMod nikdy nebyl aktualizován na verzi vyšší než 1.12 a chybí mu podpora pro velkou spoustu moderních a populárních shaderů. Takže jsem vytvořil Iris, abych se pokusil vyřešit tyto problémy a také dlouhotrvající potíže s balíčky shaderů.<br><br>Iris vyvíjím hlavně abych naplnil své vlastní potřeby shader módu orientovaného na výkon s dobrou kompatibilitou a potenciálním prostorem pro úpravy. Iris při spárování se Sodiem nabízí dobrý výkon na mém počítači, díky čemuž mohu konečně plně hrát se shadery namísto jejich neustálého zapínání, abych zachytil pěkné screenshoty, a poté jejich vypínání, jakmile mě unaví neustálé pády FPS. Smozřejmě, jak můžete vidět, nejsem ani zdaleka jediný, kdo využívá vývoje Irisu, což je důvod, proč jsem se rozhodl jej zveřejnit pro všechny jako open-source mód.<br><br>Iris má veřejné stabilní vydání pro 1.16 i 1.17, které funguje s vlastní verzí Sodia, a veřejné beta vydání pro 1.18 snapshoty. Iris je stále ve vývoji a velmi často dostává velké aktualizace, díky čemuž velmi rychle postupuje kupředu!",
      "performance": "Výkon",
      "performanceheading": "Podívejte se, jak Iris zlepšuje výkon",
      "vanilla": "Pouze vanilla",
      "vanillamessage": "Vanilla Minecraft má velmi starý základ kódu a spousta lidí tvrdí, že potřebuje přepsání, hlavně co se týče grafiky. Rychlé 3D vykreslování, přidané v 1.15, byl pokus tento problém nějakým způsobem vyřešit, ale ve spoustě případů to jen zhoršilo daný problém. V 1.17 se Minecraft přesouvá na OpenGL Core 3.2 a Javu 16, ale zatím nebyly implementovány žádné znatelné změny, které by využily výkonostní zlepšení těchto systémů. Minecraft před 1.17 také nativně nepodporoval shadery a i po vydání 1.17 je jejich podpora stále velmi omezená. Minecraft je nicméně znám pro svou nenáročnou minimalistickou grafiku a poskytuje dobrý základ pro vysokovýkonnostní grafiku založenou na shaderech.",
      "sodium": "Vanilla + <span class='text-span-4'>Sodium</span>",
      "sodiummessage": "Sodium je Fabric mód, který přepisuje části vanilla vykreslovacího systému pro optimalizaci výkonu způsobem, kterým to žádný mód před ním neudělal. Sodium je aktivně udržováno a aktualizováno a cílí na kompatibilitu s dalšími Fabric módy pro maximální FPS i s největšími modpacky. Jeho bratrské módy Lithium, Phosphor a Hydrogen, mohou být všechny použity společně se Sodiem pro optimalizaci každé stránky hry, ať už jde o tickování, světlo nebo paměť. Tyto módy mohou společně zlepšit počty FPS na 150% a více pro každého hráče, ať už cílí na maximální snímkovou frekvenci pro nejlepší PvP, nebo je Sodium a další zmíněné módy jediný způsob, jak mít hru hratelnou i na hardwaru, který má po ruce.",
      "sodiumiris": "Vanilla + <span class='text-span-4'>Sodium</span> + <span class='text-span-5'>Iris</span>",
      "sodiumirismessage": "Iris je postaveno na Sodiu i vanille poskytnutím něčeho, co před ním žádný samostatný Fabric mód nedokázal: podpora pro již existující vlastní shadery. A protože je Iris postaveno na Sodiu a vanille, můžete získat shadery s dobrou snímkovou frekvencí bez potřeby drahého hardwaru nebo experimentálních herních modifikací. Procesy navíc, které Iris provádí, snižují výkon pouze o 10-15 procent a s nainstalovaným Sodiem zůstává výkon vysoko nad normálním vanilla výkonem. V budoucnu bude Iris plně integrován a streamlinován a bude mít vlastní vykreslovací optimalizace, což umožní, aby bylo Sodium a Iris společně lepší než jakýkoli z nich sám. Tato výkonnostní vylepšení se přesouvají přímo na shadery, s nejpopulárnějšími shadery běžícími vždy nad 60 FPS, i na 5 či 6 let starém hardwaru!",
      "screenshot": "Galerie snímků",
      "screenshotsubheading": "Podívejte se, co může Iris nabídnout",
      "screenshot1": "Vyfotil Guardian pomocí SEUS v11",
      "screenshot2": "Vyfotil Guardian pomocí Sildurs Extreme VL",
      "screenshot3": "Vyfotil FoundationGames pomocí Complementary",
      "screenshot4": "Vyfotil IMS pomocí Sildurs Vibrant Extreme VL",
      "screenshot5": "Vyfotil IMS pomocí BSL v8",
      "screenshot6": "Vyfotil IMS pomocí Complementary v4.0",
      "screenshot7": "Vyfotil IMS pomocí Complementary v4.0",
      "screenshot8": "Vyfotil IMS pomocí SEUS Renewed",
      "screenshot9": "Vyfotil IMS pomocí Complementary v4.0",
      "screenshot10": "Vyfotil IMS pomocí Complementary v4.0",
      "screenshot11": "Vyfotil kinzuu_music pomocí Complementary v4.0",
      "screenshot12": "Vyfotil Justsnoopy30 pomocí Complementary v4.0 BE",
      "note": "Poznámka - BE značí snímky, které byly pořízeny s módem BetterEnd od paulevs"
    },
    {
      "downloadiris": "Stáhnout nyní - IrisShaders",
      "heading": "Instalátor Iris",
      "subheading": "Navržen tak, aby vám zpříjemnil používání Iris",
      "description": "Instalátor Iris automaticky stáhne a nainstaluje Iris a Sodium pro dobrou grafiku s plynulými snímky za vteřinu. Jednoduše spusťte instalátor, vyberte si verzi a klikněte na nainstalovat. Nevěříte? Zkuste si to sami.",
      "downloadjar": "Stáhnout univerzální JAR",
      "alternatedownloads": "Alternativní stažení",
      "alternatedownloadsubheading": "Nelíbí se vám náš praktický instalátor? Zkuste samostatnou verzi",
      "getmodrinth": "Stáhnout z Modrinth",
      "getcurseforge": "Stáhnout z CurseForge",
      "getgithub": "Zdrojový kód na GitHubu"
    }
  ],
  "common": {
    "irisshaders": "Iris Shaders",
    "home": "Domů",
    "about": "Více informací",
    "download": "Stáhnout",
    "dark": " Tmavý režim",
    "light": " Světlý režim",
    "footer1": "O projektu Iris",
    "footerdesc1": "Projekt Iris je kolaborativní open-source projekt vytvořený týmem vášnivých vývojářů, kteří chtějí udělat zážitek s Minecraft shadery nejlepší, jaký může být. Iris je vyvíjen komunitou pro komunitu.",
    "footer2": "Užitečné odkazy",
    "curseforge": "Iris na CurseForge",
    "modrinth": "Iris na Modrinth",
    "github": "GitHub",
    "discord": "Discord",
    "patreon": "Patreon",
    "copyright": "© Copyright 2026 IrisShaders. Všechna práva vyhrazena."
  }
}
