{
  "data": [
    {
      "title": "Das ist IRIS",
      "subheading": "Ein Blick in eine neue Ära der Minecraft-Grafik",
      "or": "oder",
      "continue": "Weiterlesen",
      "heading1": "Warum IRIS?",
      "subheading1": "Das macht IRIS so besonders",
      "card1": "Ausgezeichnete Mod-Kompatibilität",
      "carddesc1": "IRIS legt großen Wert auf Mod-Kompatibilität und ist bereits mit vielen deiner Lieblingsmods kompatibel!",
      "card2": "Modernes Design",
      "carddesc2": "IRIS wurde von vornherein für einfache Updates ausgelegt. Schluss mit der wochenlangen Wartezeit, um Shader in der neuen Minecraft-Version zu verwenden!",
      "card3": "Frei und Open-Source",
      "carddesc3": "IRIS ist eine Open-Source-Mod, zu der jede/-r beitragen kann. Dies ermöglicht IRIS sich durch Zusammenarbeit zu verbessern.",
      "heading2": "Merkmale",
      "subheading2": "Das hat IRIS zu bieten",
      "image1": "OptiFine-Übereinstimmung",
      "imagedesc1": "IRIS hat sich zum Ziel gesetzt, alle älteren und aktuellen OptiFine-Shaderpakete zu unterstützen, und die Anzahl der von IRIS unterstützten Pakete wächst ständig und schnell!<span class='text-span-2'><br>Screenshot von IMS</span>",
      "image2": "Funktioniert mit Sodium",
      "imagedesc2": "IRIS ist mit den Optimierungsmods von CaffeineMC wie Sodium, Lithium und Phosphor kompatibel und ermöglicht so beeindruckende Grafiken mit vergleichbarer oder sogar besserer Performance als Vanilla-Minecraft.<br><span class='text-span-2'>Screenshot von IMS</span>",
      "heading3": "Der Vorteil von IRIS",
      "subheading3": "Neue Rendertechniken, mit denen du einen Schritt voraus bist",
      "shadows": "Schatten",
      "entities": "Entities",
      "screenshottitle1": "Performance-Optimierte Schatten",
      "screenshotdesc1": "IRIS verwendet ein Verfahren namens \"Shadow Frustum Culling\", um den Overhead von Schatten, einem der größten Leistungsfresser bei Shadern, zu verringern. Mit dem Shadow Frustum Culling von IRIS erreichst du höhere FPS, ohne die Qualität von volumetrischer Beleuchtung oder Schatten zu beeinträchtigen.<br><span class='text-span-2'>Screenshot von IMS, Kappa v5</span>",
      "screenshottitle2": "Effizientes Entity-Rendering",
      "screenshotdesc2": "IRIS verbessert die Art und Weise, wie Minecraft Entities und Block-Entities wie Truhen, Schweine und Item-Frames darstellt. Dieser Trick funktioniert sogar ohne Shader und kann in Welten mit vielen Entities die Performance von Vanilla Minecraft um bis zu 60 Prozent steigern. Die Darstellung von Schatten erfährt eine besonders große Verbesserung und macht Bereiche, die früher mit Shader unspielbar waren, zu Orten, an denen deine FPS erstaunlich flüssig sind!<br><span class='text-span-2'>Screenshot von kinzuu_music</span>",
      "stillcurious": "Neugierig geworden? <a href='about.html'>Mehr erfahren</a><link rel='prefetch' href='/about.html'>."
    },
    {
      "abouttitle": "Über IRISShaders",
      "heading": "Das IRIS-Projekt",
      "subheading": "Erfahre mehr über die Shader-Sensation",
      "aboutproject": "Über das Projekt",
      "messageheading": "Eine Nachricht vom Gründer und leitenden Entwickler von IRISShaders",
      "message": "IRIS wurde entwickelt, um eine Lücke zu füllen, die ich in der Minecraft-Community für Anpassungen und grafische Verbesserungen sah: das Fehlen einer Open-Source-Mod für Shader, mit der ich meine liebsten Shaderpakete in modernen Versionen des Spiels laden kann, während die Performance und Kompatibilität mit Modpacks erhalten bleibt. OptiFine, die derzeitig führende Mod zum Laden von Shaderpaketen, hat eine restriktive Lizenz, die jeder Art von Modifikation im Wege steht, und ist ziemlich berüchtigt für Kompatibilitätsprobleme mit einigen meiner Lieblingsmods. Außerdem ist OptiFine nicht mit Sodium kompatibel, der mit Abstand besten Mod zur Rendering-Optimierung, die es gibt. ShadersMod wurde seit Version 1.12 nicht mehr aktualisiert und bietet zudem keine Unterstützung für viele der heutzutage beliebten Shaderpakete. Deshalb habe ich IRIS entwickelt, um diese sowie viele andere seit langem bestehende Probleme mit Shaderpaketen zu beheben.<br><br>Ich habe IRIS in erster Linie entwickelt, um meinem eigenen Wunsch nach einer leistungsorientierten Shader-Mod mit hervorragender Kompatibilität und Möglichkeiten zur Modifikation nachzukommen. In Verbindung mit Sodium läuft IRIS auf meinem Rechner großartig und macht es mir endlich möglich, mit Shadern wirklich zu spielen, anstatt sie nur ab und zu einzuschalten, um ein paar hübsche Screenshots zu machen, und sie danach wieder auszuschalten, wenn ich die Frame-Drops nicht mehr ertragen kann. Wie sich herausstellte, bin ich natürlich bei weitem nicht die einzige Person, die von der Entwicklung von IRIS profitiert, daher habe ich beschlossen, IRIS als Open-Source-Mod der Öffentlichkeit zugänglich zu machen.<br><br>IRIS hat inzwischen eine öffentliche stabile Version für 1.16, 1.17 und 1.18 sowie eine öffentliche Betaversion für Snapshots. IRIS befindet sich immer noch in ständiger Entwicklung und erhält sehr oft neue Verbesserungen, und macht sehr schnell Fortschritte!",
      "performance": "Performance",
      "performanceheading": "Schau dir an, wie sich die Frames mit IRIS stapeln",
      "vanilla": "Nur Vanilla",
      "vanillamessage": "Die aktuelle Minecraft-Version hat eine sehr alte Codebasis, und viele sagen, dass sie dringend überarbeitet werden muss, vor allem, wenn es um die Grafik geht. Die Einführung von Blaze-3D-Rendering in Version 1.15 sollte die Situation verbessern, hat sie aber in vielerlei Hinsicht nur noch schlimmer gemacht. Mit der Version 1.17 setzt Minecraft auf OpenGL Core 3.2 und Java 16, doch bisher wurden keine größeren Änderungen vorgenommen, um die Leistungsverbesserungen dieser Systeme zu nutzen. Minecraft unterstützte vor 1.17 auch nativ keine Shader, und selbst jetzt, nach der Veröffentlichung von 1.17, ist die Shader-Unterstützung noch immer sehr begrenzt. Allerdings ist Minecraft für seine minimalistische Grafik mit geringem Overhead bekannt und bietet eine solide Grundlage für leistungsstarke Shader-basierte Grafiken.",
      "sodium": "Vanilla + <span class='text-span-4'>Sodium</span>",
      "sodiummessage": "Sodium ist eine Fabric/Quilt-Mod, die Teile des Vanilla-Rendering-Systems überarbeitet, um die Performance so zu optimieren, wie es keine andere Mod zuvor getan hat. Sodium wird aktiv gepflegt und aktualisiert und zielt darauf ab, mit den meisten anderen Fabric/Quilt-Mods kompatibel zu sein, um auch in den größten Modpacks maximale Performance zu erreichen. Die Geschwister-Mods Lithium, Phosphor und Hydrogen können alle zusammen mit Sodium verwendet werden, um jeweils einen anderen Teil des Spiels zu optimieren, sei es das Ticken, die Beleuchtung oder der Arbeitsspeicher. Gemeinsam können diese Mods die FPS für jeden Spieler/jede Spielerin auf 150% oder mehr der Vanilla-Performance steigern, ganz egal, ob auf maximale Performance abgezielt wird, um einen Vorteil im PvP zu erlangen, oder ob Sodium und Co. die einzigen Mods sind, die das Spiel auf der vorhandenen Hardware spielbar machen.",
      "sodiumIRIS": "Vanilla + <span class='text-span-4'>Sodium</span> + <span class='text-span-5'>IRIS</span>",
      "sodiumIRISmessage": "IRIS erweitert sowohl Sodium als auch Vanilla, indem es bereits bestehende benutzerdefinierte Shader unterstützt - etwas, das noch keine eigenständige Fabric/Quilt-Mod bisher ermöglicht hat. Und da IRIS mit Sodium und Vanilla zusammenarbeitet, können Shader mit erstaunlicher Performance verwendet werden, ohne dass teure Hardware oder experimentelle Mods benötigt werden. Die zusätzlichen Berechnungen, die IRIS durchführt, reduzieren die Performance um nur 10-15 Prozent, und wenn Sodium installiert ist, bleibt die Performance weit über der von Vanilla! Dies überträgt sich direkt auf Shader, wobei die meisten gängigen Shader durchgängig mit 60 FPS oder mehr laufen, sogar auf 5 oder 6 Jahre alter Hardware!",
      "screenshot": "Screenshot-Galerie",
      "screenshotsubheading": "Schau dir an, was IRIS zu bieten hat",
      "screenshot1": "Aufgenommen von Guardian mit SEUS v11",
      "screenshot2": "Aufgenommen von Guardian mit Sildurs Extreme VL",
      "screenshot3": "Aufgenommen von FoundationGames mit Complementary",
      "screenshot4": "Aufgenommen von IMS mit Sildurs Vibrant Extreme VL",
      "screenshot5": "Aufgenommen von IMS mit BSL v8",
      "screenshot6": "Aufgenommen von IMS mit Complementary v4.0",
      "screenshot7": "Aufgenommen von IMS mit Complementary v4.0",
      "screenshot8": "Aufgenommen von IMS mit SEUS Renewed",
      "screenshot9": "Aufgenommen von IMS mit Complementary v4.0",
      "screenshot10": "Aufgenommen von IMS mit Complementary v4.0",
      "screenshot11": "Aufgenommen von kinzuu_music mit Complementary v4.0",
      "screenshot12": "Aufgenommen von Justsnoopy30 mit Complementary v4.0 BE",
      "note": "Hinweis - BE kennzeichnet Screenshots, die Inhalte aus der BetterEnd-Mod von paulevs enthalten."
    },
    {
      "downloadIRIS": "Jetzt herunterladen - IRISShaders",
      "heading": "Der IRIS-Installer",
      "subheading": "entwickelt, um das IRIS-Erlebnis zu erleichtern",
      "description": "Der IRIS-Installer lädt IRIS und Sodium automatisch herunter und installiert sie, um großartige Grafiken mit flüssigen FPS zu ermöglichen. Führe einfach den Installer aus, wähle deine Version und klicke auf \"Installieren\". Du glaubst uns nicht? Probiere es selbst aus!",
      "downloadjar": "Universelle JAR herunterladen",
      "alternatedownloads": "Alternative Downloads",
      "alternatedownloadsubheading": "Unser handlicher Installer ist nicht dein Stil? Probiere die Standalone-Version",
      "getmodrinth": "Auf Modrinth herunterladen",
      "getcurseforge": "Auf CurseForge herunterladen",
      "getgithub": "Quellcode auf GitHub erhalten"
    }
  ],
  "common": {
    "IRISshaders": "IRIS Shaders",
    "home": "Startseite",
    "about": "Mehr erfahren",
    "download": "Jetzt herunterladen",
    "dark": " Dunkles Design",
    "light": " Helles Design",
    "footer1": "Über das IRIS-Projekt",
    "footerdesc1": "Das IRIS-Projekt ist ein gemeinschaftliches Open-Source-Projekt, das von einem Team leidenschaftlicher Entwickler/-innen ins Leben gerufen wurde, um für Minecraft das bestmögliche Shader-Erlebnis zu schaffen. IRIS wird von der Community, für die Community entwickelt.",
    "footer2": "Nützliche Links",
    "curseforge": "IRIS auf CurseForge",
    "modrinth": "IRIS auf Modrinth",
    "github": "GitHub",
    "discord": "Discord",
    "patreon": "Patreon",
    "copyright": "© Copyright 2024 IRISShaders. Alle Rechte vorbehalten."
  }
}
