{
    "data":[
        {
          "title": "Das ist Iris",
          "home": "Startseite",
          "about": "Mehr erfahren",
          "download": "Jetzt herunterladen",
          "dark": " Dunkler Modus",
          "light": " Heller Modus",
          "subheading": "Ein Blick in die neue Ära der Minecraft-Grafik",
          "or": "oder",
          "continue": "Weiterlesen",
          "heading1": "Warum Iris?",
          "subheading1": "Das ist was Iris besonders macht",
          "card1": "Tolle Mod-Kompatibilität",
          "carddesc1": "Iris hat sich verpflichtet Mod-Kompatibilität als oberste Priorität zu gewährleisten und ist bereits mit vielen deiner Lieblings-Mods kompatibel!",
          "card2": "Modernes Design",
          "carddesc2": "Iris wurde von Grund auf so entwickelt, dass es erweiterbar und einfach zu aktualisieren ist. Verabschiede dich von wochenlangem Warten, um Shader in der neuen Minecraft-Version zu verwenden!",
          "card3": "Kostenlos und Open-Source",
          "carddesc3": "Iris ist eine Open-Source-Mod, zu der jeder beitragen kann. Dies ermöglicht Iris, sich durch Zusammenarbeit zu verbessern.",
          "heading2": "Funktionen",
          "subheading2": "Was Iris zu bieten hat",
          "image1": "OptiFine-Parität",
          "imagedesc1": "Iris hat sich zum Ziel gesetzt, alle älteren und aktuellen OptiFine-Shaderpacks vollständig zu unterstützen und die Anzahl der von Iris unterstützten Shaderpacks wächst ständig und schnell!<span class='text-span-2'><br>Screenshot von Niko</span>",
          "image2": "Funktioniert mit Sodium",
          "imagedesc2": "Iris ist kompatibel mit CaffeineMC-Optimierungsmods wie Sodium und Phosphor, welche atemberaubende Grafiken bei vergleichbaren oder sogar besseren FPS als bei Vanilla ermöglichen.<br><span class='text-span-2'>Screenshot von Guardian</span>",
          "heading3": "Der Iris-Vorteil",
          "subheading3": "Neue Rendering-Techniken, mit denen du einen Vorsprung hast",
          "shadows": "Schatten",
          "entities": "Entities",
          "screenshottitle1": "Performance-Optimierte Schatten",
          "screenshotdesc1": "Iris verwendet eine Technik namens Shadow Frustum Culling, um den Overhead einer der größten Leistungsfresser eines Shaders zu verringern - die Schatten. Mit dem Shadow Frustum Culling von Iris kannst du höhere Frameraten erreichen, ohne die Qualität der volumetrischen Beleuchtung oder der Schatten zu opfern.<br><span class='text-span-2'>Screenshot von FoundationGames</span>",
          "screenshottitle2": "Effizientes Entity-Rendering",
          "screenshotdesc2": "Iris verbessert die Art und Weise, wie Minecraft Entities und Block-Entities wie Truhen, Schweine und Item-Frames rendert. Dieser Trick funktioniert sogar mit deaktivierten Shadern und kann in Welten mit vielen Entities die Vanilla-Leistung um bis zu 60% steigern! Das Schatten-Rendering erfährt eine besonders große Verbesserung und macht Bereiche, die einst mit Shadern unspielbar waren zu Orten, an denen deine FPS überraschend flüssig sind.<br><span class='text-span-2'>Screenshot von kinzuu_music</span>",
          "stillcurious": "Noch neugierig? <a href='about.html'>Mehr erfahren</a><link rel='prefetch' href='/about'>.",
          "footer1": "Über das Iris-Projekt",
          "footerdesc1": "Das Iris-Projekt ist ein gemeinschaftliches Open-Source-Projekt, das von einem Team leidenschaftlicher Entwickler ins Leben gerufen wurde, um die Minecraft-Shader-Erfahrung so gut wie möglich zu machen. Iris wird von der Community, für die Community entwickelt.",
          "footer2": "Nützliche Links",
          "curseforge": "Iris auf CurseForge",
          "modrinth": "Iris auf Modrinth",
          "copyright": "© Copyright 2021 IrisShaders. Alle Rechte vorbehalten."
        },
        {
          "abouttitle": "Über IrisShaders",
          "home": "Startseite",
          "about": "Mehr erfahren",
          "download": "Jetzt herunterladen",
          "dark": " Dunkler Modus",
          "light": " Heller Modus",
          "heading": "Das Iris-Projekt",
          "subheading": "Mehr über die Shader-Sensation erfahren",
          "aboutproject": "Über das Projekt",
          "messageheading": "Eine Nachricht vom Gründer und Hauptentwickler von Iris Shaders",
          "message": "Iris wurde erstellt, um eine Lücke zu füllen, die ich in der Minecraft-Community für Anpassungen und grafische Verbesserungen sah: das Fehlen einer Open-Source Shader-Mod, mit der ich meine Lieblings-Shaderpacks auf modernen Versionen des Spiels laden kann, während die Leistung und Kompatibilität mit Modpacks erhalten bleibt. OptiFine, die derzeit dominierende Mod zum Laden von Shaderpacks, hat eine restriktive Lizenzierung, die jeder Art von Bastelei im Wege steht, und ist ziemlich bekannt für Kompatibilitätsprobleme mit den Mods, die ich mag. Es ist auch nicht kompatibel mit Sodium, die mit Abstand beste Mod zur Rendering-Optimierung, die es gibt. ShadersMod wurde nie über 1.12 hinaus aktualisiert, und es fehlt die Unterstützung für viele der modernen, beliebten Shaderpacks. Also habe ich Iris entwickelt, um zu versuchen, diese Probleme zu lösen und auch viele andere langjährige Probleme mit Shaderpacks anzugehen.<br><br>Ich habe Iris in erster Linie entwickelt, um meine eigenen Bedürfnisse nach einer leistungsorientierten ShadersMod mit guter Kompatibilität und Potenzial zum Basteln zu erfüllen. In Verbindung mit Sodium liefert Iris auf meinem Rechner eine großartige Leistung und macht es mir endlich möglich, tatsächlich mit Shadern zu spielen, anstatt sie nur ab und zu einzuschalten, um hübsche Screenshots zu machen, und sie dann wieder auszuschalten, sobald ich genug von Frame-Drops habe. Natürlich, wie sich herausstellt, bin ich bei weitem nicht die einzige Person, die von der Entwicklung von Iris profitiert, weshalb ich mich entschlossen habe, es der Öffentlichkeit als Open-Source-Mod zur Verfügung zu stellen.<br><br>Iris hat eine öffentliche stabile Version für 1.16, die mit einer angepassten Version von Sodium funktioniert, und eine öffentliche Beta-Version für 1.17, die derzeit nicht mit Sodium funktioniert (derzeit gibt es keine offizielle Version von Sodium für 1.17). Iris befindet sich immer noch in intensiver Entwicklung und erhält jede Woche neue Verbesserungen, und macht sehr schnelle Fortschritte!",
          "performance": "Leistung",
          "performanceheading": "Deine FPS schießen mit Iris in die Höhe",
          "vanilla": "Nur Vanilla",
          "vanillamessage": "Vanilla Minecraft hat eine sehr alte Codebasis, und viele meinen eine Neufassung wäre notwendig, vor allem, wenn es um die Grafik geht. Blaze 3D-Rendering, welches in 1.15 hinzugefügt wurde, war ein Versuch, dies etwas zu lindern, aber in vielerlei Hinsicht hat es das Problem nur verschlimmert. In 1.17 wechselte Minecraft zu OpenGL Core 3.2 und Java 16, aber bisher wurden keine größeren Änderungen implementiert, die die Leistungsverbesserungen dieser Systeme nutzen. Minecraft unterstützte vor 1.17 auch nativ keine Shader, und selbst seit der Veröffentlichung von 1.17 ist die Shader-Unterstützung sehr begrenzt. Minecraft ist jedoch bekannt für seine minimalistischen Grafiken mit geringem Overhead und bietet eine starke Grundlage für leistungsstarke Shader-basierte Grafik.",
          "sodium": "Vanilla + <span class='text-span-4'>Sodium</span>",
          "sodiummessage": "Sodium ist eine Fabric-Mod, der Teile des Vanilla-Rendering-Systems umschreibt, um die Leistung auf eine Weise zu optimieren, die keine andere Mod zuvor getan hat. Sodium wird aktiv gepflegt und aktualisiert und zielt darauf ab, mit den meisten anderen Fabric-Mods kompatibel zu sein, um maximale FPS auch in den dichtesten Modpacks zu erreichen. Die Geschwister-Mods, Lithium, Phosphor und Hydrogen, können alle in Verbindung mit Sodium verwendet werden, um jeweils einen anderen Aspekt des Spiels zu optimieren, sei es Ticks, Beleuchtung oder RAM-Auslastung. Diese Mods zusammen können die FPS auf 150% oder mehr der Vanilla-Performance für jeden Spieler steigern, egal ob du auf maximale Frames abzielst, um dir einen PvP-Vorteil zu verschaffen, oder ob Sodium und Co. die einzigen Mods sind, die das Spiel auf der vorhandenen Hardware spielbar machen können.",
          "sodiumiris": "Vanilla + <span class='text-span-4'>Sodium</span> + <span class='text-span-3'>Iris</span>",
          "sodiumirismessage": "Iris baut sowohl auf Sodium als auch auf Vanilla auf und bietet etwas, das kein eigenständiger Fabric-Mod zuvor hatte: Unterstützung für vorhandene benutzerdefinierte Shader. Und weil Iris mit Sodium und Vanilla funktioniert, kannst du Shader mit bemerkenswerten FPS erhalten, ohne dass du teure Hardware oder experimentelle Spielmodifikationen benötigst. Die zusätzlichen Prozesse, die Iris ausführt, reduzieren die Leistung nur um 10-15 Prozent, und mit installiertem Sodium bleibt die Leistung deutlich über der Vanilla-Leistung. In der Zukunft wird Iris vollständig integriert und optimiert sein und sogar eigene Rendering-Optimierungen haben, so dass Sodium und Iris zusammen besser sein werden als jeder von ihnen allein. Und diese Leistungssteigerungen übertragen sich direkt auf die Shader, wobei die meisten beliebten Shader durchgängig mit 60 FPS oder mehr laufen, selbst auf 5 und 6 Jahre alter Hardware!",
          "screenshot": "Screenshot-Galerie",
          "screenshotsubheading": "Siehe was Iris zu bieten hat",
          "screenshot1": "Von Guardian mit SEUS v11 aufgenommen",
          "screenshot2": "Von Guardian mit Sildurs Extreme VL aufgenommen",
          "screenshot3": "Von FoundationGames mit Complementary aufgenommen",
          "screenshot4": "Von IMS mit Sildurs Vibrant Extreme VL aufgenommen",
          "screenshot5": "Von IMS mit BSL v8 aufgenommen",
          "screenshot6": "Von IMS mit Complementary v4.0 aufgenommen",
          "screenshot7": "Von IMS mit Complementary v4.0 aufgenommen",
          "screenshot8": "Von IMS mit SEUS Renewed aufgenommen",
          "screenshot9": "Von IMS mit Complementary v4.0 aufgenommen",
          "screenshot10": "Von IMS mit Complementary v4.0 aufgenommen",
          "screenshot11": "Von kinzuu_music mit Complementary v4.0 aufgenommen",
          "screenshot12": "Von Justsnoopy30 mit Complementary v4.0 BE aufgenommen",
          "note": "Randbemerkung - BE zeigt Screenshots an, die Inhalte aus dem BetterEnd-Mod von paulevs enthalten",
          "footer1": "Über das Iris-Project",
          "footerdesc1": "Das Iris-Projekt ist ein gemeinschaftliches Open-Source-Projekt, das von einem Team leidenschaftlicher Entwickler ins Leben gerufen wurde, um die Minecraft-Shader-Erfahrung so gut wie möglich zu machen. Iris wird von der Community, für die Community entwickelt.",
          "footer2": "Nützliche Links",
          "curseforge": "Iris auf CurseForge",
          "modrinth": "Iris auf Modrinth",
          "copyright": "© Copyright 2021 IrisShaders. Alle Rechte vorbehalten."
        },
        {
          "downloadiris": "Jetzt herunterladen - IrisShaders",
          "home": "Startseite",
          "about": "Mehr erfahren",
          "download": "Jetzt herunterladen",
          "dark": " Dunkler Modus",
          "light": " Heller Modus",
          "heading": "Der Iris-Installer",
          "subheading":"entwickelt, um Dein Iris-Erlebnis zu optimieren",
          "description": "Der Iris-Installer wird automatisch Iris und Sodium herunterladen und installieren, um großartige Grafik bei flüssigen Framerates zu ermöglichen. Führe einfach den Installer aus, wähle deine Version aus und klicke auf Installieren. Du glaubst uns nicht? Probiere es selbst aus.",
          "downloadjar": "Universelle JAR Herunterladen",
          "alternatedownloads": "Alternative Downloads",
          "alternatedownloadsubheading": "Unser nützlicher Installer ist nicht dein Stil? Probiere die Standalone-Version",
          "getmodrinth": "Von Modrinth herunterladen",
          "getcurseforge": "Von CurseForge herunterladen",
          "getgithub": "Quellcode von GitHub erhalten",
          "footer1": "Über das Iris-Projekt",
          "footerdesc1": "Das Iris-Projekt ist ein gemeinschaftliches Open-Source-Projekt, das von einem Team leidenschaftlicher Entwickler ins Leben gerufen wurde, um die Minecraft-Shader-Erfahrung so gut wie möglich zu machen. Iris wird von der Community, für die Community entwickelt.",
          "footer2": "Nützliche Links",
          "curseforge": "Iris auf CurseForge",
          "modrinth": "Iris auf Modrinth",
          "copyright": "© Copyright 2021 IrisShaders. Alle Rechte vorbehalten."
        }
      ]
}
