{
    "data":[
        {
          "title": "Esto es Iris",
          "home": "Inicio",
          "about": "Aprende más",
          "download": "Descargar ahora",
          "dark": " Modo oscuro",
          "light": " Modo claro",
          "subheading": "La lente a una nueva era de gráficos en minecraft",
          "or": "o",
          "continue": "Seguir leyendo",
          "heading1": "¿Por qué Iris?",
          "subheading1": "Esto es lo que hace a Iris diferente",
          "card1": "Gran compatibilidad con mods",
          "carddesc1": "Iris está comprometida a asegurar la compatibilidad con mods como prioridad, ¡y ya es compatible con muchos de tus mods favoritos!",
          "card2": "Diseño Moderno",
          "carddesc2": "Iris ha sido construida desde el principio para ser extendible y fácil de actualizar. ¡Di adiós a semanas de espera para usar shaders en la nueva actualización de Minecraft!",
          "card3": "Libre y de Código Abierto",
          "carddesc3": "Iris es un mod de código abierto al que cualquiera puede contribuir. Esto permite a Iris mejorar al facilitar la colaboración.",
          "heading2": "Características",
          "subheading2": "Lo que Iris tiene que ofrecer",
          "image1": "Paridad con OptiFine",
          "imagedesc1": "Iris apunta a tener soporte completo para todos los shaderpacks de OptiFine pasados y actuales, ¡y el número de packs soportados por Iris aumenta constantemente!<span class='text-span-2'><br>Captura por Niko</span>",
          "image2": "Funciona con Sodium",
          "imagedesc2": "Iris es compatible con los mods de optimización de CaffeineMC, como Sodium y Phosphor, permitiendo gráficos impresionantes con FPS comparables o incluso mejores que en vanilla.<br><span class='text-span-2'>Captura por Guardian</span>",
          "heading3": "La ventaja de Iris",
          "subheading3": "Nuevas técnicas de renderizado que te ponen en la delantera del juego",
          "shadows": "Sombras",
          "entities": "Entidades",
          "screenshottitle1": "Sombras Optimizadas para el Rendimiento",
          "screenshotdesc1": "Iris usa una técnica llamada Frustum Culling de Sombras para reducir los costes de uno de los mayores consumidores de rendimiento de un shader - las sombras. Usando el frustrum culling de Iris, serás capaz de obtener más altos FPS sin sacrificar la calidad de la iluminación volumétrica o las sombras.<br><span class='text-span-2'>Captura por FoundationGames</span>",
          "screenshottitle2": "Renderizado de Entidades Eficiente",
          "screenshotdesc2": "Iris mejora la forma en que Minecraft renderiza entidades y bloques con entidades como cofres, cerdos, o marcos para objetos. Este truco funciona hasta con los shaders desactivados, y en mundos con muchas entidades, puede hasta mejorar el rendimiento en vanilla por hasta un 60 por ciento. La renderización de sombras encuentra una mejora especialmente grande, ¡haciendo zonas que una vez fueron injugables con shaders sitios donde tus FPS són sorprendientemente estables!<br><span class='text-span-2'>Captura por kinzuu_music</span>",
          "footer1": "Acerca del Proyecto Iris",
          "footerdesc1": "El Proyecto Iris Project es un proyecto colaborativo y de código abierto creado por un equipo de desarroladores apasionados intentando hacer la experiencia de shaders en Minecraft la mejor posible. Iris está desarrolado por la comunidad, para la comunidad.",
          "footer2": "Enlaces útiles",
          "stillcurious": "¿Aun dudas? <a href='about.html'>Aprende más</a><link rel='prefetch' href='/about'>.",
          "curseforge": "Iris en CurseForge",
          "modrinth": "Iris en Modrinth",
          "copyright": "© Copyright 2021 IrisShaders. Todos los derechos reservados."
        },
        {
          "abouttitle": "Acerca de IrisShaders",
          "home": "Inicio",
          "about": "Aprende más",
          "download": "Descargar ahora",
          "dark": " Modo oscuro",
          "light": " Modo claro",
          "heading": "El proyecto Iris",
          "subheading": "Aprende más sobre la sensación de shaders",
          "aboutproject": "Acerca del proyecto",
          "messageheading": "Un mensaje del fundador y principal desarrollador de Iris Shaders",
          "message": "Iris fue creado para llenar un vacío que vi en la comunidad de personalización y mejora gráfica de Minecraft: la falta de un mod para shaders de código abierto que me permitiese cargar mis shader packs favoritos en versiones modernas del juego, manteniendo el rendimiento y la compatibilidad con modpacks. OptiFine, el mod actualmente dominante para cargar shader packs, tiene una licencia restrictiva que impide jugar con tus opciones, y es muy conocido por tener problemas de compatibilidad con los mods que me gustan. También es mutuamente incompatible con Sodium, el mejor mod de optimización de renderizado que existe por un gran margen. ShadersMod nunca se actualizó después de la 1.12, y no soporta muchos de los nuevos shaderpacks modernos. Así que creé Iris, para intentar resolver estos problemas, y además poner solución a muchos otros longevos problemas con los shader packs.<br><br>Principalmente desarrollo Iris para mi propia necesidad de un mod de shaders orientado al rendimiento con buena compatibilidad y compatibilidad para jugar con el programa. Cuando unes Iris con Sodium obtengo un gran rendimiento en mi ordenador, haciendo completamente posible para mí el jugar con shaders en vez de a veces activarlos para tomar capturas de pantalla bonitas, y luego apagarlos de nuevo en cuanto me canso de las caídas de frames. Por supuesto, como parece que es, no soy ni de lejos la única persona que se favorece del desarrollo de Iris, razón por la que decidí lanzarlo al público como un mod de código abierto.<br><br>Iris tiene una versión estable para la 1.16 que funciona con una versión algo modificada de Sodium, y una beta pública para la 1.17 que aun no funciona con Sodium (ahora mismo no hay versión oficial de Sodium para la 1.17). ¡Iris está aun en fuerte desarrollo y trae nuevas mejoras cada semana, y está progresando muy rápidamente!",
          "performance": "Rendimiento",
          "performanceheading": "Mira como los frames se amontonan con Iris",
          "vanilla": "Sólo Vanilla",
          "vanillamessage": "Minecraft Vanilla tiene una base de código muy anticuada, y muchos dicen que tiene una gran necesidad de ser reescrito, especialmente en lo que se refiere a gráficos. El renderizado Blaze 3D, añadido en la 1.15, fue un intento de aliviar esto de alguna forma, pero en muchos respectos sólo empeoró este problema. En la 1.17, Minecraft está moviendose a OpenGL Core 3.2 y Java 16, pero hasta ahora no ha habido cambios significativos para utilitzar las mejoras de rendimiento de estos sistemas. Minecraft antes de la 1.17 tampoco soportaba nativamente shaders, e incluso desde que la 1.17 fue lanzada, el soporte para shader es muy limitado. Sin embargo, Minecraft es conocido por sus gráficos minimalistas de bajo coste, y provee de unos buenos cimientos para gráficos basados en shaders de alto rendimiento.",
          "sodium": "Vanilla + <span class='text-span-4'>Sodium</span>",
          "sodiummessage": "Sodium es un mod para fabric que reescribe partes del sistema de renderizado de vanilla para optimizar el rendimiento de una forma de la que ningún otro mod lo ha hecho antes. Sodium está activamente trabajado y actualizado, y apunta a ser compatible con la mayoría del resto de mods de Fabric para los máximos FPS incluso en los modpacks más densos. Sus mods hermanos, Lithium, Phosphor y Hydrogen, pueden todos ser usados en tándem con Sodium para cada uno optimizar un aspecto diferente del juego, ya sean los ciclos del juego, la iluminación, o el uso de memoria respectivamente. Esos mods juntos pueden aumentar los FPS a un 150% o más que el rendimiento de vanilla para cualquier jugador, ya estés apuntando a los máximos frames para ese margen del PvP, o si Sodium y similares son los únicos mods que pueden hacer el juego jugable en el hardware que tienes a mano.",
          "sodiumiris": "Vanilla + <span class='text-span-4'>Sodium</span> + <span class='text-span-3'>Iris</span>",
          "sodiumirismessage": "Iris está construido sobre ambos Sodium y Vanilla dando soporte a lo que ningún mod de fabric ha dado por sí mismo: soporte para shaders existentes. Y como Iris se suma con Sodium y Vanilla, puedes obtener shaders con FPS remarcables, sin la necesidad de hardware caro o modificaciones del juego experimentales. Los procesos extra que Iris hace solo reducen el rendimiento por un 10-15 por ciento, y con sodium instalado el rendimiento se mantiene muy por encima del rendimiento de vanilla. En un futuro, Iris estará completamente integrado y directo al grano, y tendrá aun más optimizaciones de renderizado por sí mismo, permitiendo que Sodium e Iris juntos sean mejores que cualquiera de ellos por separado. Y esas mejoras de rendimiento se transfieren directamente a los shaders, con los shaders más populares funcionando consistentemente a o por encima de 60 fps, ¡incluso en hardware de hace 5 y 6 años!",
          "screenshot": "Galería de Capturas",
          "screenshotsubheading": "Mira lo que Iris te puede ofrecer",
          "screenshot1": "Capturado por Guardian usando SEUS v11",
          "screenshot2": "Capturado por Guardian usando Sildurs Extreme VL",
          "screenshot3": "Capturado por FoundationGames usando Complementary",
          "screenshot4": "Capturado por IMS usando Sildurs Vibrant Extreme VL",
          "screenshot5": "Capturado por IMS usando BSL v8",
          "screenshot6": "Capturado por IMS usando Complementary v4.0",
          "screenshot7": "Capturado por IMS usando Complementary v4.0",
          "screenshot8": "Capturado por IMS usando SEUS Renewed",
          "screenshot9": "Capturado por IMS usando Complementary v4.0",
          "screenshot10": "Capturado por IMS usando Complementary v4.0",
          "screenshot11": "Capturado por kinzuu_music usando Complementary v4.0",
          "screenshot12": "Capturado por Justsnoopy30 usando Complementary v4.0 BE",
          "note": "Nota - BE indica capturas con contenido del mod BetterEnd por paulevs",
          "footer1": "Acerca del Proyecto Iris",
          "footerdesc1": "El Proyecto Iris Project es un proyecto colaborativo y de código abierto creado por un equipo de desarroladores apasionados intentando hacer la experiencia de shaders en Minecraft la mejor posible. Iris está desarrolado por la comunidad, para la comunidad.",
          "footer2": "Enlaces útiles",
          "curseforge": "Iris en CurseForge",
          "modrinth": "Iris en Modrinth",
          "copyright": "© Copyright 2021 IrisShaders. Todos los derechos reservados."
        },
        {
          "downloadiris": "Descargar Ahora - IrisShaders",
          "home": "Inicio",
          "about": "Aprende más",
          "download": "Descargar ahora",
          "dark": " Modo oscuro",
          "light": " Modo claro",
          "heading": "El Instalador de Iris",
          "subheading":"diseñado para simplificar tu experiencia con Iris",
          "description": "El instalador de Iris descargará e instalará Iris y Sodium para increíbles gráficos a buenos FPS. Simplemente ejecuta el instalador, elige tu versión, y pulsa instalar. ¿No nos crees? Pruébalo tú mismo.",
          "downloadjar": "Descargar JAR Universal",
          "alternatedownloads": "Descargas alternativas",
          "alternatedownloadsubheading": "¿Nuestro práctico instalador no es tu estilo? Descarga el mod por sí mismo",
          "getmodrinth": "Descargar en Modrinth",
          "getcurseforge": "Descargar en CurseForge",
          "getgithub": "Obtén el código en GitHub",
          "footer1": "Acerca del Proyecto Iris",
          "footerdesc1": "El Proyecto Iris Project es un proyecto colaborativo y de código abierto creado por un equipo de desarroladores apasionados intentando hacer la experiencia de shaders en Minecraft la mejor posible. Iris está desarrolado por la comunidad, para la comunidad.",
          "footer2": "Enlaces útiles",
          "curseforge": "Iris en CurseForge",
          "modrinth": "Iris en Modrinth",
          "copyright": "© Copyright 2021 IrisShaders. Todos los derechos reservados."
        }
      ]
}