{
  "data": [
    {
      "title": "Voici Iris",
      "subheading": "Une ouverture vers une nouvelle ère de graphismes minecraft",
      "or": "ou",
      "continue": "Continuer à lire",
      "heading1": "Pourquoi choisir Iris?",
      "subheading1": "Voici ce qui rend Iris différent",
      "card1": "Bonne compatibilité avec les autres mods",
      "carddesc1": "Iris s'engage en première priorité à assurer la compatibilité avec les différents mods et est déjà compatible avec beaucoup de vos mods préférés !",
      "card2": "Conception moderne",
      "carddesc2": "Iris a été conçu dès le départ pour être extensible et facile à mettre à jour. Dites adieu aux semaines d'attente pour utiliser les shaders sur la nouvelle version de Minecraft !",
      "card3": "Gratuit et Open Source",
      "carddesc3": "Iris est un mod open source auquel tout le monde peut contribuer. Cela permet à Iris de s'améliorer en facilitant la collaboration.",
      "heading2": "Fonctionnalités",
      "subheading2": "Ce qu'Iris a à offrir",
      "image1": "Concurrence avec OptiFine",
      "imagedesc1": "Iris vise à avoir un support complet pour tous les shaderpacks OptiFine passés et présents, et le nombre de packs supportés par Iris augmente constamment et rapidement !<span class='text-span-2'><br>Capture d'écran par Niko</span>",
      "image2": "Compatible avec Sodium",
      "imagedesc2": "Iris est compatible avec les mods d'optimisation CaffeineMC tels que Sodium et Phosphor, permettant des graphismes époustouflants à des images comparables ou même meilleures que Vanilla.<br><span class='text-span-2'>Capture d'écran par Guardian</span>",
      "heading3": "L'avantage Iris",
      "subheading3": "De nouvelles techniques de rendu qui vous donnent une longueur d'avance",
      "shadows": "Ombres",
      "entities": "Entités",
      "screenshottitle1": "Ombres optimisées pour les performances",
      "screenshotdesc1": "Iris utilise une technique appelée Shadow Frustum Culling pour diminuer les frais généraux de l'un des plus gros accapareurs de performances d'un shader : les ombres. En utilisant le shadow frustum culling d&#x27;Iris, vous pourrez atteindre des fréquences d&#x27;image plus élevées sans sacrifier la qualité de l&#x27;7éclairage volumétrique ou des ombres.<br><span class='text-span-2'>Capture d'écran par FoundationGames</span>",
      "screenshottitle2": "Rendu d'entité efficace",
      "screenshotdesc2": "Iris améliore la façon dont Minecraft affiche les entités et blocks les entités comme les coffres, les cochons et les cadres d'objets. Cette astuce fonctionne même avec les shaders désactivés, et dans les mondes avec beaucoup d'entités, elle peut augmenter les performances de Vanilla jusqu'à 60%. Le rendu des ombres connaît une amélioration particulièrement importante, transformant des zones autrefois injouables avec les shaders en des endroits où votre FPS est étonnamment fluide !<br><span class='text-span-2'>Capture d'écran par kinzuu_music</span>",
      "stillcurious": "Curieux ? <a href='about.html'>En savoir plus</a><link rel='prefetch' href='/about.html'>."
    },
    {
      "abouttitle": "À propos d'Iris",
      "heading": "Le projet Iris",
      "subheading": "À propos de la sensation des Shaders",
      "aboutproject": "À propos du projet",
      "messageheading": "Un message du fondateur et développeur principal chez Iris Shaders",
      "message": "Iris a été créé pour combler un vide que j'ai vu dans la communauté de personnalisation et d'amélioration graphique de Minecraft : l'absence d'un mod de shaders open source qui me permettrait de charger mes packs de shaders préférés sur les versions modernes du jeu, tout en conservant les performances et la compatibilité avec les mods. OptiFine, le mod dominant actuel pour le chargement des packs de shaders, a une licence restrictive qui s'oppose fermement à toute sorte de bricolage, et est assez connu pour avoir des problèmes de compatibilité avec les mods que j'aime. Il est également mutuellement incompatible avec Sodium, le meilleur mod d'optimisation de rendu existant de loin. ShadersMod n'a jamais été mis à jour après la 1.12, et il ne prend pas en charge bon nombre des nombreux shaderpacks populaires modernes. J'ai donc créé Iris pour essayer de résoudre ces problèmes, et également pour résoudre de nombreux autres problèmes de longue date avec les packs de shaders.<br><br>Je développe avant tout Iris pour répondre à mes propres besoins d'un mod de shaders orienté performance avec une bonne compatibilité et potentiel de bricolage. Iris, lorsqu'il est associé à Sodium, offre d'excellentes performances sur ma machine, me permettant enfin de jouer avec des shaders au lieu de les allumer périodiquement pour prendre de jolies captures d'écran, puis de les éteindre une fois que je suis fatigué des chutes d'images. Bien sûr, il s'avère que je suis loin d'être la seule personne à vouloir bénéficier du développement d'Iris, c'est pourquoi j'ai décidé de le rendre public en tant que mod open-source.<br><br>Iris a une version publique stable pour la 1.16 qui fonctionne avec une version personnalisée de Sodium, et une version bêta publique pour la 1.17 qui ne fonctionne actuellement pas avec Sodium (actuellement, il n'y a pas de version officielle de Sodium pour la 1.17). Iris est encore en plein développement et bénéficie de nouvelles améliorations chaque semaine, et progresse très rapidement !",
      "performance": "Performance",
      "performanceheading": "Regardez les fréquences d'image avec Iris",
      "vanilla": "Vanilla seulement",
      "vanillamessage": "Vanilla Minecraft a une très vieille base de code, et beaucoup disent qu'elle a grand besoin d'une réécriture, surtout en ce qui concerne les graphismes. Le rendu Blaze 3D, ajouté dans la version 1.15, était une tentative d'atténuer quelque peu ce problème, mais à bien des égards, il n'a fait qu'aggraver le problème. Dans la version 1.17, Minecraft passe à OpenGL Core 3.2 et Java 16, mais jusqu'à présent, aucun changement significatif n'a été mis en œuvre pour utiliser les améliorations de performances de ces systèmes. Minecraft avant la version 1.17 ne prenait pas non plus en charge nativement les shaders, et même depuis la sortie de la version 1.17, la prise en charge des shaders est très limitée. Cependant, Minecraft est connu pour ses graphismes minimalistes à faible surcharge et fournit une base solide pour des graphismes hautes performances basés sur des shaders.",
      "sodium": "Vanilla + <span class='text-span-4'>Sodium</span>",
      "sodiummessage": "Sodium est un mod Fabric qui réécrit des parties du système de rendu vanilla pour optimiser les performances d'une manière qu'aucun autre mod n'a fait auparavant. Sodium est activement maintenu et mis à jour, et vise à être compatible avec la plupart des autres mods Fabric pour un maximum de FPS, même dans les modpacks les plus denses. Ses mods frères, Lithium, Phosphor et Hydrogen, peuvent tous être utilisés avec Sodium pour chacun optimiser un aspect différent du jeu, qu'il s'agisse respectivement de ticking, d'éclairage ou de mémoire. Ensemble, ces mods peuvent augmenter les FPS à 150% ou plus des performances vanilla pour n'importe quel joueur, que vous visiez un maximum d'images pour vous donner un avantage PvP, ou que Sodium et autres soient les seuls mods qui peuvent faire le jeu jouable sur le matériel dont vous disposez.",
      "sodiumiris": "Vanilla + <span class='text-span-4'>Sodium</span> + <span class='text-span-3'>Iris</span>",
      "sodiumirismessage": "Iris s'appuie à la fois sur Sodium et Vanilla en fournissant quelque chose qu'aucun mod Fabric n'avait auparavant : la prise en charge des shaders personnalisés existants. Et parce qu'Iris s'empile avec Sodium et Vanilla, vous pouvez obtenir des shaders à des fréquences d'images remarquables, sans avoir besoin de matériel coûteux ou de modifications de jeu expérimentale. Les processus supplémentaires exécutés par l'iris ne réduisent les performances que de 10 à 15 %, et avec sodium installé, les performances restent bien au-dessus des performances de vanilla. À l'avenir, Iris sera entièrement intégré et aura même ses propres optimisations de rendu, permettant à Sodium et Iris ensemble d'être meilleurs que l'un ou l'autre seul. Et ces augmentations de performances sont transférées directement aux shaders, les shaders les plus populaires s'exécutant constamment à 60 ips ou au-dessus, même sur du matériel de cinq et six ans !",
      "screenshot": "Gallerie de capture d'écrans",
      "screenshotsubheading": "Voici ce que Iris a à offrir",
      "screenshot1": "Capture d'écran par Guardian utilisant SEUS v11",
      "screenshot2": "Capture d'écran par Guardian utilisant Sildurs Extreme VL",
      "screenshot3": "Capture d'écran par FoundationGames utilisant Complementary",
      "screenshot4": "Capture d'écran par IMS utilisant Sildurs Vibrant Extreme VL",
      "screenshot5": "Capture d'écran par IMS utilisant BSL v8",
      "screenshot6": "Capture d'écran par IMS utilisant Complementary v4.0",
      "screenshot7": "Capture d'écran par IMS utilisant Complementary v4.0",
      "screenshot8": "Capture d'écran par IMS utilisant SEUS Renewed",
      "screenshot9": "Capture d'écran par IMS utilisant Complementary v4.0",
      "screenshot10": "Capture d'écran par IMS utilisant Complementary v4.0",
      "screenshot11": "Capture d'écran par kinzuu_music utilisant Complementary v4.0",
      "screenshot12": "Capture d'écran par Justsnoopy30 utilisant Complementary v4.0 BE",
      "note": "Remarque - BE indique des captures d'écran qui utilisent le mod BetterEnd de paulevs"
    },
    {
      "downloadiris": "Télécharger - IrisShaders",
      "heading": "L'installateur Iris",
      "subheading": "conçu pour améliorer votre expérience Iris",
      "description": "Le programme d'installation d'Iris téléchargera et installera automatiquement Iris et Sodium pour de superbes graphismes à des fréquences d'images fluides. Exécutez simplement le programme d'installation, choisissez votre version et cliquez sur Installer. Vous ne nous croyez pas ? Essayez-le par vous-même.",
      "downloadjar": "Télécharger le JAR universel",
      "alternatedownloads": "Téléchargements alternatifs",
      "alternatedownloadsubheading": "Notre installateur pratique n'est pas votre style ? Essayez la version autonome",
      "getmodrinth": "Télécharger depuis Modrinth",
      "getcurseforge": "Télécharger depuis CurseForge",
      "getgithub": "Voir le code source sur GitHub"
    }
  ],
  "common": {
    "home": "Menu",
    "about": "À propos",
    "download": "Télécharger",
    "dark": " Mode sombre",
    "light": "Mode clair",
    "footer1": "À propos du projet Iris",
    "footerdesc1": "Le projet Iris est un projet collaboratif open source créé par une équipe de développeurs passionnés cherchant à faire en sorte que l'éxperience des shaders Minecraft est la meilleure possible. Iris est développé par la communauté, pour la communauté",
    "footer2": "Liens utiles",
    "curseforge": "Iris sur CurseForge",
    "modrinth": "Iris sur Modrinth",
    "copyright": "© Copyright 2022 IrisShaders. Tous droits réservés."
  }
}
