{
    "data":[
        {
          "title": "Dit is Iris",
          "subheading": "Een lens naar een nieuw tijdperk van minecraft graphics",
          "or": "of",
          "continue": "Door gaan met lezen",
          "heading1": "Waarom Iris?",
          "subheading1": "Dit is wat Iris anders maakt",
          "card1": "Goede mod compatibiliteit",
          "carddesc1": "Iris zet zich in om mod compatibiliteit als eerste prioriteit te zetten, en werkt al met veel van jouw favorite mods!",
          "card2": "Modern Design",
          "carddesc2": "Iris is vanaf de grond opgebouwd om uitbreidbaar en eenvoudig te updaten is. Zeg vaarwel op weken of waiting om shaders te gebruiken op de nieuwe Minecraft versie!",
          "card3": "Gratis and Open Source",
          "carddesc3": "Iris is een open source mod waar iedereen aan kan bijdragen. Dit maakt het mogelijk Iris te verbeteren door het faciliteren van samenwerking.",
          "heading2": "Functies",
          "subheading2": "Wat heeft Iris aan te bieden?",
          "image1": "OptiFine Gelijkheid",
          "imagedesc1": "Iris streeft naar volledige ondersteuning voor alle oudere en huidige OptiFine shaderpacks, en het aantal packs dat door Iris wordt ondersteund, groeit voortdurend en snel!<span class='text-span-2'><br>Screenshot door Niko</span>",
          "image2": "Werkt met Sodium",
          "imagedesc2": "Iris werkt met CaffeineMC optimalisatie mods zoals Sodium en Phosphor, waardoor verbluffende graphics mogelijk zijn met frames die vergelijkbaar zijn met of zelfs beter zijn dan vanilla.<br><span class='text-span-2'>Screenshot door Guardian</span>",
          "heading3": "De Iris voordeel",
          "subheading3": "Nieuwe rendering technieken waarmee u een voorsprong heeft in de game",
          "shadows": "Schaduwen",
          "entities": "Entiteiten",
          "screenshottitle1": " prestatie-geoptimaliseerde schaduwen",
          "screenshotdesc1": "Iris gebruikt een techniek genaamt Schaduw Frustum Culling om de overhead van één van de grootste prestatievarkens van een shader te verminderen - De schaduws. Met Iris&#x27;s schaduw frustum culling, kan je hogere frames halen zonder de de kwaliteit van volumetrische verlichting of schaduwen op te offeren.<br><span class='text-span-2'>Screenshot door FoundationGames</span>",
          "screenshottitle2": "Efficiënte entiteit Rendering",
          "screenshotdesc2": "Iris verbetert hoe Minecraft entiteiten rendert en blok entiteiten zoals chests, pigs, en voorwerplijsten. Deze truc werkt zelfs met shaders uit, en in werelden met veel entiteiten, kan het vanilla prestatie verbeteren tot 60 procent. Schaduw rendering ziet vooral een grote verbetering, met het maken van gebieden die ooit onspeelbaar waren met shaders in plaatsen waar je FPS verrassend soepel is! <br><span class='text-span-2'>Screenshot door kinzuu_music</span>",
          "stillcurious": "Nog steeds nieuwsgierig? <a href='about.html'>Leer Meer</a><link rel='prefetch' href='/about'>."
        },
        {
          "abouttitle": "Over IrisShaders",
          "heading": "het Iris Project",
          "subheading": "Leer meer over de Shader Sensatie",
          "aboutproject": "over het Project",
          "messageheading": "een bericht van de oprichter en hhoofdontwikkelaar bij Iris Shaders",
          "message": "Iris is gemaakt om een leegte te vullen die ik zag in de Minecraft gemeenschap voor aanpassing en grafische verbetering: het ontbreken van een open-source shaders mod waarmee ik mijn favoriete shaderpacks op moderne versies van de game kon laden, terwijl de prestaties en compatibiliteit met modpacks goed bleven. OptiFine, de huidige dominante mod voor het laden van shaderpacks, heeft restrictieve licenties die in de weg staat voor enige soort of verandering, en is vrij berucht vanwege het hebben van compatibiliteitsproblemen met de mods die ik leuk vind. Het is wekr ook niet met Sodium, de beste rendering optimalisatie mod die er bestaat met een grote marge. ShadersMod is nooit na 1.12 bijgewerkt en biedt geen ondersteuning voor veel van de vele moderne populaire shaderpacks. Dus heb ik Iris gemaakt om te proberen dit problemen op te lossen, en ook om veel andere langdurige problemen met shaderpacks aan te pakken..<br><br>Ik ontwikkel Iris in de eerste plaats om te voldoen aan mijn eigen behoeften aan een prestatiegerichte shadersmod met goede compatibiliteit en potentieel voor verandering. Iris in combinatie met Sodium levert geweldige prestaties op mijn machine, waardoor ik eindelijk volledig met shaders kan spelen in plaats van ze gewoon periodiek in te schakelen om mooie screenshots te maken en ze vervolgens uit te schakelen zodra ik klaar ben met de frame drops. Natuurlijk, zo blijkt, ben ik verre van de enige persoon die profiteert van de ontwikkeling van Iris, daarom heb ik besloten om het als een open-source mod voor het publiek vrij te geven.<br><br>Iris heeft een openbare stabiele release voor 1.16 die werkt met een aangepaste versie van Sodium, en een openbare bètaversie voor 1.17 die momenteel niet werkt met Sodium (momenteel is er geen officiële versie van Sodium voor 1.17). Iris is nog volop in ontwikkeling en krijgt elke week nieuwe verbeteringen en gaat zeer snel vooruit!",
          "performance": "Prestaties",
          "performanceheading": "Zie hoe de frames het doen met Iris",
          "vanilla": "Alleen vanilla",
          "vanillamessage": "Vanilla Minecraft heeft een hele oude codebase, en velen zeggen dat het dringend herschreven moet worden, vooral als het om graphics gaat. Blaze 3D-rendering, toegevoegd in 1.15, was een poging om dit enigszins te verlichten, maar in veel opzichten verergerde het probleem alleen maar. In 1.17 gaat Minecraft over naar OpenGL Core 3.2 en Java 16, maar tot nu toe zijn er geen significante veranderingen doorgevoerd die gebruikmaken van de prestatieverbeteringen van deze systemen. Minecraft vóór 1.17 ondersteunde ook geen native shaders, en zelfs sinds 1.17 is uitgebracht, is shader-ondersteuning zeer beperkt. Minecraft staat echter bekend om zijn minimalistische graphics met lage overheadkosten en biedt een sterke basis voor krachtige, op shaders gebaseerde graphics.",
          "sodium": "Vanilla + <span class='text-span-4'>Sodium</span>",
          "sodiummessage": "Sodium is een Fabric mod die delen van het vanilla renderingsysteem herschrijft om te optimaliseren voor prestaties op een manier die geen enkele andere mod eerder heeft gedaan. Sodium wordt actief onderhouden en bijgewerkt en streeft ernaar compatibel te zijn met de meeste andere Fabric mods voor maximale FPS, zelfs in de grootste modpacks. De ander mods van de zelfde maker, Lithium, Phosphor en Hydrogen, kunnen allemaal worden gebruikt in combinatie met Sodium om elk een ander aspect van het spel te optimaliseren, of het nu respectievelijk tikken, verlichting of geheugen is. Deze mods samen kunnen FPS verhogen tot 150% of meer van vanilla prestaties voor elke speler die er is, of je nu streeft naar maximale frames om je PvP-voorsprong te geven, of dat Sodium en dergelijke de enige mods zijn die het spel speelbaar maakt op de hardware die je hebt.",
          "sodiumiris": "Vanilla + <span class='text-span-4'>Sodium</span> + <span class='text-span-3'>Iris</span>",
          "sodiumirismessage": "Iris bouwt op zowel Sodium als vanilla door iets te bieden dat geen enkele standalone Fabric mod eerder heeft gehad: ondersteuning voor bestaande aangepaste shaders. En omdat Iris op Sodium en vanilla bouwt, kun je shaders krijgen met opmerkelijke framesnelheden, zonder dat je dure hardware of experimentele spelaanpassingen nodig hebt. De extra processen die iris uitvoert, verminderen de prestaties slechts met 10-15 procent, en als Sodium is geïnstalleerd, blijven de prestaties ruim boven de vanilla prestaties. In de toekomst zal Iris volledig geïntegreerd en gestroomlijnd zijn, en zal het zelfs zijn eigen rendering optimalisaties hebben, waardoor Sodium en Iris samen beter zijn dan elk van hen alleen. En deze prestatieverbeteringen worden direct overgedragen naar shaders, waarbij de meeste populaire shaders constant op of boven 60 fps draaien, zelfs op 5 en 6 jaar oude hardware!",
          "screenshot": "Screenshot Galerij",
          "screenshotsubheading": "Zie wat Iris te offeren heeft",
          "screenshot1": "Vastgelegd door Guardian met SEUS v11",
          "screenshot2": "Vastgelegd door Guardian met Sildurs Extreme VL",
          "screenshot3": "Vastgelegd door FoundationGames met Complementary",
          "screenshot4": "Vastgelegd door IMS met Sildurs Vibrant Extreme VL",
          "screenshot5": "Vastgelegd door IMS met BSL v8",
          "screenshot6": "Vastgelegd door IMS met Complementary v4.0",
          "screenshot7": "Vastgelegd door IMS met Complementary v4.0",
          "screenshot8": "Vastgelegd door IMS met SEUS Renewed",
          "screenshot9": "Vastgelegd door IMS met Complementary v4.0",
          "screenshot10": "Vastgelegd door IMS met Complementary v4.0",
          "screenshot11": "Vastgelegd door kinzuu_music met Complementary v4.0",
          "screenshot12": "Vastgelegd door Justsnoopy30 met Complementary v4.0 BE",
          "note": "Opmerking - BE geeft screenshots aan met inhoud van de BetterEnd mod van paulevs"
        },
        {
          "downloadiris": "Download Nu- IrisShaders",
          "heading": "De Iris Installatieprogramma",
          "subheading":"ontworpen om uw Iris ervaring te stroomlijnen",
          "description": "Het installatieprogramma van Iris zal automatisch Iris en Sodium downloaden en installeren voor geweldige graphics met vloeiende framerates. Voer gewoon het installatieprogramma uit, kies uw versie en klik op installeren. Gelooft u ons niet? Probeer het zelf.",
          "downloadjar": "Download Universele JAR",
          "alternatedownloads": "Alternatieve Downloads",
          "alternatedownloadsubheading": "Onze handige Installer is niet jouw stijl? Probeer de standalone versie",
          "getmodrinth": "Download van Modrinth",
          "getcurseforge": "Download van CurseForge",
          "getgithub": "Source ophalen van GitHub"
        }
      ],
      "common":{
        "irisshaders": "Iris Shaders",
        "home": "Thuis",
        "about": "Leer meer",
        "download": "Download Nu",
        "dark": " Donkere modus",
        "light": " Licht modus",
        "footer1": "Over het Iris project",
        "footerdesc1": "Het Iris Project is een gezamenlijk open-source project gecreëerd door een team van gepassioneerde ontwikkelaars die de Minecraft shaders ervaring het beste willen maken. Iris is ontwikkeld door de gemeenschap, voor de gemeenschap.",
        "footer2": "Handige links",
        "curseforge": "Iris op CurseForge",
        "modrinth": "Iris op Modrinth",
        "github": "GitHub",
        "discord": "Discord",
        "patreon": "Patreon",
        "copyright": "© Copyright 2021 IrisShaders. Alle rechten voorbehouden."
      }
}
