{
  "data": [
    {
      "title": "Este é o Iris",
      "subheading": "O futuro da área gráfica do Minecraft",
      "or": "ou",
      "continue": "Continue lendo",
      "heading1": "Por que usar o Iris?",
      "subheading1": "Isso é o que torna o Iris diferente:",
      "card1": "Compatibilidade com mods",
      "carddesc1": "O Iris está comprometido em garantir a compatibilidade total com mods, e já é compatível com a maioria dos mods disponíveis!",
      "card2": "Design moderno",
      "carddesc2": "Iris foi criado pensando em expansividade e atualizações. Adeus à espera de semanas para usar shaders a cada nova versão do Minecraft!",
      "card3": "Gratuito e Open Source",
      "carddesc3": "O Iris é um mod open source, onde qualquer um pode contribuir, assim, permitindo melhorias e compatibilidade aumentada por facilitar a colaboração.",
      "heading2": "Características",
      "subheading2": "O que o Iris tem a oferecer",
      "image1": "Paridade com OptiFine",
      "imagedesc1": "O Iris tem como objetivo suportar todas as shaders feitas para o OptiFine, até mesmo as antigas. E o número de shaders compatíveis não para de subir!<span class='text-span-2'><br>Capturada por Niko</span>",
      "image2": "Funciona com o Sodium",
      "imagedesc2": "O Iris é compatível com os mods de optimização do CaffeineMC, como Sodium e Phosphor, permitindo belos gráficos com FPS geralmente melhores que o Minecraft Vanilla.<br><span class='text-span-2'>Capturada por Guardian</span>",
      "heading3": "A vantagem do Iris",
      "subheading3": "Novas técnicas de renderização que o colocam à frente do jogo",
      "shadows": "Sombras",
      "entities": "Entidades",
      "screenshottitle1": "Sombras otimizadas para uma melhor performance",
      "screenshotdesc1": "Iris usa uma técnica chamada 'Shadow Frustum Culling', que diminui um dos maiores vilões de desmpenho - as sombras. Usando o Shadow Frustum Culling do Iris, você conseguirá mais frames sem sacrificar a qualidade da iluminação volumétrica ou das sombras.<br><span class='text-span-2'>Capturada  por FoundationGames</span>",
      "screenshottitle2": "Renderização eficiente de entidades",
      "screenshotdesc2": "Iris melhora a forma que o Minecraft renderiza entidades e blocos com entidades como baús, porcos e molduras. Esse truque funciona até mesmo com shaders desativados, inclusive em mundos cheios de entidades, podendo melhorar a performance do Minecraft vanilla em até 60%! A renderização das sombras é a principal melhoria trazida pelo mod, fazendo com que áreas onde uma vez eram impossíveis de se jogar com shaders, agora ficam surpreendentemente estáveis!<br><span class='text-span-2'>Capturada por kinzuu_music</span>",
      "stillcurious": "Ainda curioso? <a href='about.html'>Saiba Mais</a><link rel='prefetch' href='/about.html'>."
    },
    {
      "abouttitle": "Sobre o Iris",
      "heading": "O Projeto Iris",
      "subheading": "Saiba mais sobre a nova geração de Shaders",
      "aboutproject": "Sobre o projeto",
      "messageheading": "Uma mensagem do fundador e desenvolvedor-chefe do Iris Shaders",
      "message": "O Iris foi criado para preencher um vazio que eu via na comunidade de customização e melhoria gráfica do Minecraft: A falta de um mod para shaders, open source, que me permitia carregar os shaders favoritos nas versões mais novas do jogo, mantendo a performance e compatibilidade com outros mods. O OptiFine, mod dominante de optimização e shaders, tem licenças restritivas, que atrapalham qualquer forma de modificação nele, além de ser conhecido pelas notórias incompatibilidades com alguns mods que jogo. ShadersMod, por exemplo, nunca foi atualizado além da 1.12, e carece de muito dos recursos presentes em outros shaders modernos, além de ser mutualmente incompatível com Sodium, que é, de longe, o melhor mod de otimização de renderização atual. Então, eu criei o Iris para tentar resolver esses problemas, e também diversos outros probelmas de longa data presentes nos Shaders.<br><br> A princípio, desenvolvi o Iris para atender a minha própria necessidade de um mod de shader focado em performance com boa compatibilidade e possibilidade de ajustes. E quando combinado com Sodium, entrega um ótimo desempenho em meu computador, assim, finalmente me possibilitando jogar com shaders, ao invés de apenas usar para screenshots e logo depois desativá-las por conta das quedas de FPS. Claro que, no fim, eu não era a única pessoa que beneficiaria com o essas vantagens trazidas pelo Iris, por isso decidi lançá-lo publicamente como um mod de código aberto.<br><br> O Iris tem uma versão estável e oficial para 1.16, 1.17, e 1.18, e uma beta pública para as Snapshots. O Iris ainda está em desenvolvimento, e frequentemente ganha novas melhorias e otimizações, e está progredindo bem rapidamente!",
      "performance": "Performance",
      "performanceheading": "Veja como a as vantagens somam ao usar o Iris",
      "vanilla": "Apenas o Vanilla",
      "vanillamessage": "O Minecraft vanilla tem um código muito antigo, e muitos dizem que precisa ser reescrito, especialmente na parte gráfica. A atualização chamada de 'Blaze 3D', vinda com o Minecraft 1.15, foi uma tentativa  de, em parte, melhorar isso, mas no fim acabou mais piorando do que ajudando. Na 1.17, o Minecraft atualizou para OpenGL Core 3.2 e Java 16, mas nada de significante foi feito para utilizar as melhorias trazidas pelas versões mais recente de ambos. Antes da 1.17, o Minecraft também não suportava shaders nativamente, e, mesmo depois de lançado, o seu suporte ainda é muito limitado. Mas o Minecraft é conhecido pelos seus gráficos leves e minimalistas, e também por permitir gráficos baseados em shaders de alta performance.",
      "sodium": "Vanilla + <span class='text-span-4'>Sodium</span>",
      "sodiummessage": "O Sodium é um mod Fabric que reescreve partes do sistema de renderização do Minecraft, otimizando a performance de um jeito que nenhum outro mod jamais fez, além de ser ativamente mantido e atualizado, focando em ser compatível com a maioria dos mods Fabric para maximizar os FPS, mesmo nos mods mais densos e completos. Seus mods irmãos, que são Lithium, Phosphor e Hydrogen, podem ser usados em conjunto com o Sodium para, assim, cada um otimizar diferentes aspectos do jogo, seja nos ciclos do jogo (ticks), iluminação ou memória, respectivamente. Juntos, esses mods podem incrementar os FPS em 150% pra mais comparado ao vanilla, permitindo assim qualquer um aumentar os FPS e estabilidade, seja para obter uma vantagem no PvP, ou que tenha que usá-los como a única maneira de tornar o Minecraft jogável em seu computador.",
      "sodiumiris": "Vanilla + <span class='text-span-4'>Sodium</span> + <span class='text-span-3'>Iris</span>",
      "sodiumirismessage": "Iris, quando usado em conjunto com Minecraft Vanilla e Sodium, entrega algo que nenhum outro mod Fabric jamais fez: Dar suporte a shaders. Você pode usar shaders com um framerate surpreendentemente alto (comparado ao OptiFine) sem precisar recorrer para upgrades em seu computador ou gambiarras no jogo Vanilla. E apesar do Iris custar entre 10 a 15% dos frames, graças ao Sodium os FPS continuam similares ou até mesmo maiores que no jogo Vanilla. No futuro, o Iris estará totalmente otimizado, tendo até mesmo as próprias otimizações gráficas (assim como OptiFine), fazendo com que ambos, Sodium e Iris, se agregem ao ponto em que o desempenho deles somados seja maior que usar apenas um, e essas melhorias de desempenho se traduzem diretamente ás Shaders, com a maioria rodando estavelmente acima dos 30fps, mesmo em hardware antigo de 5 ou 6 anos atrás!",
      "screenshot": "Galeria de capturas",
      "screenshotsubheading": "Veja o que o Iris tem a oferecer",
      "screenshot1": "Capturada por Guardian usando SEUS v11",
      "screenshot2": "Capturada por Guardian usando Sildurs Extreme VL",
      "screenshot3": "Capturada por FoundationGames usando Complementary",
      "screenshot4": "Capturada por IMS usando Sildurs Vibrant Extreme VL",
      "screenshot5": "Capturada por IMS usando BSL v8",
      "screenshot6": "Capturada por IMS usando Complementary v4.0",
      "screenshot7": "Capturada por IMS usando Complementary v4.0",
      "screenshot8": "Capturada por IMS usando SEUS Renewed",
      "screenshot9": "Capturada por IMS usando Complementary v4.0",
      "screenshot10": "Capturada por IMS usando Complementary v4.0",
      "screenshot11": "Capturada por kinzuu_music usando Complementary v4.0",
      "screenshot12": "Capturada por Justsnoopy30 usando Complementary v4.0 BE",
      "note": "Detalhe - BE indica capturas que mostram conteúdos do mod BetterEnd de paulevs"
    },
    {
      "downloadiris": "Baixe agora - Iris",
      "heading": "Instalador do Iris",
      "subheading": "Desenvolvido para melhorar sua experiência com Iris",
      "description": "O Instalador irá automaticamente baixar e instalar o Iris, o Fabric Mod Loader, e Sodium, assim trazendo belos gráficos a um desempenho estável. Simplesmente abra o instalador, escolha a sua versão de Minecraft e clique em instalar. Não acredita em nós? Teste!",
      "downloadjar": "Baixar .jar universal",
      "alternatedownloads": "Outras alternativas",
      "alternatedownloadsubheading": "Nosso instalador não faz seu estilo? Baixe apenas o mod Iris",
      "getmodrinth": "Baixe do Modrinth",
      "getcurseforge": "Baixe do CurseForge",
      "getgithub": "Pegue o código fonte pelo GitHub"
    }
  ],
  "common": {
    "irisshaders": "Iris Shaders",
    "home": "Início",
    "about": "Saiba Mais",
    "download": "Baixe Agora",
    "dark": " Modo Escuro",
    "light": " Modo Claro",
    "footer1": "Sobre o Projeto Iris",
    "footerdesc1": "O Projeto Iris é um projeto open source criado por um time de desenvolvedores aficionados em trazer a melhor experiência possível de shaders no Minecraft. Iris é desenvolvido pela comunidade para a comunidade.",
    "footer2": "Links úteis",
    "curseforge": "Iris no CurseForge",
    "modrinth": "Iris no Modrinth",
    "github": "GitHub",
    "discord": "Discord",
    "patreon": "Patreon",
    "copyright": "© Copyright 2026 IrisShaders. Todos os direitos reservados."
  }
}
