{
  "data":[
      {
        "title": "Это Iris",
        "subheading": "Взгляд в новую эру графики Minecraft",
        "or": "или",
        "continue": "Продолжить чтение",
        "heading1": "Почему Iris?",
        "subheading1": "То, что отличает Iris",
        "card1": "Прекрасная совместимость с модами",
        "carddesc1": "Iris в первую очередь стремится обеспечить совместимость и уже совместим со многими из ваших любимых модов!",
        "card2": "Современный дизайн",
        "carddesc2": "Iris был разработан с нуля, чтобы быть гибким и легко обновляемым. Попрощайтесь с неделями ожидания поддержки шейдеров в новых версиях Minecraft!",
        "card3": "Бесплатный и открытый",
        "carddesc3": "Iris - это мод с открытым исходным кодом, в который может внести свой вклад любой желающий. Это позволяет Iris улучшаться благодаря содействию сообщества.",
        "heading2": "Возможности",
        "subheading2": "Что может предложить Iris",
        "image1": "Паритет с OptiFine",
        "imagedesc1": "Iris стремится иметь полную поддержку существовавших и существующих пакетов шейдеров OptiFine, и число шейдеров, поддерживаемых в Iris, стабильно и быстро растёт!<span class='text-span-2'><br>Скриншот от Coder</span>",
        "image2": "Работает с Sodium",
        "imagedesc2": "Iris совместим с модами оптимизации от CaffeineMC, такими как Sodium и Phosphor, обеспечивая потрясающую графику в кадрах, сравнимых с Vanilla, или даже лучше.<br><span class='text-span-2'>Скриншот от IMS</span>",
        "heading3": "Преимущества Iris",
        "subheading3": "Новые методики рендеринга, которые выводят игру на новый уровень",
        "shadows": "Тени",
        "entities": "Сущности",
        "screenshottitle1": "Оптимизированные тени",
        "screenshotdesc1": "Iris использует технику, называемую Shadow Frustum Culling, чтобы уменьшить воздействие одной из самых больших проблем шейдеров - теней. С использованием Shadow Frustum Culling вы сможете достичь более высокой частоты кадров, не жертвуя качеством объёмного освещения или теней.<br><span class='text-span-2'>Скриншот от HiItsDevin_</span>",
        "screenshottitle2": "Эффективный рендеринг сущностей",
        "screenshotdesc2": "Iris улучшает способ визуализации сущностей и блоков-сущностей, таких как сундуки, свиньи и рамки. Этот приём работает даже с отключёнными шейдерами, а в мирах с большим количеством сущностей прирост производительности может составить до 60%. Рендеринг теней особенно сильно улучшается, превращая локации, которые когда-то были неиграбельными с шейдерами, в места, где ваш FPS удивительно плавный!<br><span class='text-span-2'>Скриншот от kinzuu_music</span>",
        "stillcurious": "Всё ещё интересно? <a href='about.html'>Узнать больше</a><link rel='prefetch' href='/about.html'>."
      },
      {
        "abouttitle": "О IrisShaders",
        "heading": "Проект Iris",
        "subheading": "Узнайте больше о тонкостях шейдеров",
        "aboutproject": "О проекте",
        "messageheading": "Обращение от основателя и ведущего разработчика Iris Shaders",
        "message": "Iris был создан, чтобы заполнить пустоту, которую я видел в сообществе персонализации Minecraft и улучшения графики: отсутствие мода с открытым исходным кодом, который позволил бы мне загружать мои любимые пакеты шейдеров в современных версиях игры, сохраняя при этом производительность и совместимость с модпаками. OptiFine, пока что доминирующий мод для загрузки пакетов шейдеров, имеет ограниченное лицензирование, которое твёрдо препятствует любому вмешательству, и довольно печально известен своими проблемами совместимости с модами, которые мне нравятся. Он также несовместим с Sodium, лучшим из существующих модов оптимизации рендеринга. ShadersMod вообще не обновлялся после 1.12, в нём недостаточно поддержки для многих современных популярных шейдеров. Поэтому я создал Iris, чтобы попытаться решить как эти, так и многие другие давние проблемы с пакетами шейдеров.<br><br>В первую очередь я разрабатываю Iris для удовлетворения моей собственной потребности в моде шейдеров, ориентированном на производительность, с хорошей совместимостью и потенциалом для совершенствования. Iris в паре с модом Sodium обеспечивает отличную производительность на моём ПК, наконец, позволяя мне полностью играть с шейдерами, а не просто периодически включать их, чтобы делать красивые скриншоты, а затем выключать, как только я устану от падений кадров. Конечно, как оказалось, я далеко не единственный человек, которому будет полезна разработка Iris, поэтому я решил выпустить его для широкой публики как мод с открытым исходным кодом.<br><br>Iris имеет общедоступные стабильные релизы для Minecraft 1.16.5 и выше, но всё ещё активно разрабатывается, часто получает новые улучшения и развивается очень быстро!",
        "performance": "Производительность",
        "performanceheading": "Смотрите, как кадры складываются с Iris",
        "vanilla": "Только Vanilla",
        "vanillamessage": "Ванильный Minecraft имеет очень старую кодовую базу, и многое говорит, что он остро нуждается в переписывании, особенно когда речь заходит о графике. Движок Blaze 3D, добавленный в 1.15, был попыткой несколько облегчить эту проблему, но во многих отношениях только усугубил её. В 1.17 Minecraft перешёл на OpenGL Core 3.2 и Java 16, но всё ещё не было реализовано никаких существенных изменений, которые бы использовали улучшения производительности этих систем. Minecraft до 1.17 не имел нативной поддержки шейдеров, и даже с выходом 1.17 возможности шейдеров пока остаются сильно ограниченными. Тем не менее, Minecraft известен своей минималистичной графикой с низкими требованиями, что обеспечивает прочную основу для высокопроизводительной шейдерной графики.",
        "sodium": "Vanilla + <span class='text-span-4'>Sodium</span>",
        "sodiummessage": "Sodium – это мод для Fabric, который переписывает части ванильной системы рендеринга для повышения производительности так эффективно, как ни один другой мод до него. Sodium активно поддерживается и обновляется, стремясь быть совместимым с большинством других модов Fabric ради максимального FPS даже в огромных сборках. Его родственные моды – Lithium, Phosphor и Hydrogen – могут использоваться в сочетании с Sodium для оптимизации различных аспектов игры, таких как серверные вычисления, освещение или использование памяти соответственно. Вместе все эти моды могут поднять ваш FPS на 150% и более в сравнении с производительностью ванильного Minecraft для каждого игрока, независимо от того, стремитесь ли вы максимально повысить частоту кадров ради преимущества в PvP, или это единственный способ сделать Minecraft играбельным на вашем устройстве.",
        "sodiumiris": "Vanilla + <span class='text-span-4'>Sodium</span> + <span class='text-span-5'>Iris</span>",
        "sodiumirismessage": "Iris основывается как на Sodium, так и на Vanilla, предоставляя то, чего не было ни в одном другом моде для Fabric – поддержку уже существующих шейдеров. А из-за того, что Iris сочетается с Sodium и Vanilla, вы можете получить шейдеры с замечательной частотой кадров, без необходимости в дорогостоящем оборудовании или экспериментальных модификациях игры. Дополнительные процессы, которые Iris выполняет, снижают производительность рендеринга лишь на 10-15%, но с установленным Sodium  производительность останется намного выше ванильной. В будущем Iris станет полностью комплексным и модернизированным, и даже будет иметь собственные решения в оптимизации рендеринга, позволяя Sodium и Iris работать совместно даже лучше, чем каждый из них по отдельности. И это улучшение производительности влияет непосредственно на шейдеры. При этом, большинство популярных шейдеров стабильно выдаёт 60 fps и больше, даже на оборудовании 5 и 6-летней давности!",
        "screenshot": "Галерея скриншотов",
        "screenshotsubheading": "Посмотрите, что может предложить Iris",
        "screenshot1": "Снято Guardian с использованием SEUS v11",
        "screenshot2": "Снято Guardian с использованием Sildurs Extreme VL",
        "screenshot3": "Снято FoundationGames с использованием Complementary",
        "screenshot4": "Снято IMS с использованием Sildurs Vibrant Extreme VL",
        "screenshot5": "Снято IMS с использованием BSL v8",
        "screenshot6": "Снято IMS с использованием Complementary v4.0",
        "screenshot7": "Снято IMS с использованием Complementary v4.0",
        "screenshot8": "Снято IMS с использованием SEUS Renewed",
        "screenshot9": "Снято IMS с использованием Complementary v4.0",
        "screenshot10": "Снято IMS с использованием Complementary v4.0",
        "screenshot11": "Снято kinzuu_music с использованием Complementary v4.0",
        "screenshot12": "Снято Justsnoopy30 с использованием Complementary v4.0 BE",
        "note": "Примечание – BE обозначены скриншоты, которые демонстрируют контент из мода BetterEnd от paulevs"
      },
      {
        "downloadiris": "Скачать - IrisShaders",
        "heading": "Установщик Iris",
        "subheading":"Создан, чтобы упростить ваш опыт работы с Iris",
        "description": "Установщик Iris автоматически загрузит и установит Iris и Sodium для лучшей графики при плавной частоте кадров. Просто запустите установщик, выберите версию и нажмите \"Install\". Не верится? Попробуйте сами!",
        "downloadjar": "Скачать универсальный JAR",
        "alternatedownloads": "Альтернативная загрузка",
        "alternatedownloadsubheading": "Наш удобный установщик не в вашем стиле? Попробуйте автономную версию",
        "getmodrinth": "Загрузить с Modrinth",
        "getcurseforge": "Загрузить с CurseForge",
        "getgithub": "Получить исходный код на GitHub"
      }
    ],
    "common":{
      "irisshaders": "Iris Shaders",
      "home": "Домой",
      "about": "Узнать больше",
      "download": "Скачать",
      "dark": " Ночной режим",
      "light": " Дневной режим",
      "footer1": "О проекте Iris",
      "footerdesc1": "Проект Iris - это совместный проект с открытым исходным кодом, созданный командой страстных разработчиков, стремящихся сделать использование шейдеров в Minecraft максимально эффективным. Iris разрабатывается сообществом, для сообщества.",
      "footer2": "Полезные ссылки",
      "curseforge": "Iris на CurseForge",
      "modrinth": "Iris на Modrinth",
      "github": "GitHub",
      "discord": "Discord",
      "patreon": "Patreon",
      "copyright": "© Copyright 2022 IrisShaders. Все права защищены."
    }
}
