{
  "data": [
    {
      "title": "Detta är Iris",
      "subheading": "En lins till en ny era av minecraft grafik",
      "or": "eller",
      "continue": "Fortsätt läsa",
      "heading1": "Varför Iris?",
      "subheading1": "Detta är vad som gör iris annorlunda",
      "card1": "Bra mod kompatibilitet",
      "carddesc1": "Iris jobbar hårt för att säkerställa mod kompatibilitet som en första prioritet, och är redan kompatibelt med många av dina favorit mods!",
      "card2": "Modern Design",
      "carddesc2": "Iris har byggts från grunden för att vara adaptivt och lätt att uppdatera. Säg hejdå till att vänta i veckor för att använda shaders med den nya Minecraft versionen!",
      "card3": "Fri och Öppen Källkod",
      "carddesc3": "Iris är ett mod med öppen källkod som vem som helst kan bidra till. Detta gör att Iris kan förbättras genom samarbete.",
      "heading2": "Funktioner",
      "subheading2": "Det Iris har att erbjuda",
      "image1": "Paritet med OptiFine",
      "imagedesc1": "Målet är att Iris ska vara kompatibelt med tidigare och nuvarande OptiFine shader-paket, och antalet paket som stödjs av Iris ökar snabbt och stadigt!<span class='text-span-2'><br>Skärmbild av Niko</span>",
      "image2": "Fungerar med Sodium",
      "imagedesc2": "Iris är kompatibelt med CaffeineMC optimiserings mods så som Sodium och Phosphor, vilket möjliggör fantastisk grafik med frame rates likt eller till och med högre än vanilla.<br><span class='text-span-2'>Skärmbild av Guardian</span>",
      "heading3": "Fördelen med Iris",
      "subheading3": "Nya renderings tekniker som ställer dig i framkant",
      "shadows": "Skuggor",
      "entities": "Entities",
      "screenshottitle1": "Prestanda-Optimerade Skuggor",
      "screenshotdesc1": "Iris använder en teknik som kallas Shadow Frustum Culling för att minimera kostnaden av en av de mest krävan aspekterna av en shader - skuggorna. Genom att använda Iris shadow frustum culling så kommer du kunna nå högre frame rates utan att att offra kvaliteten på volumetriskt ljus eller skuggor.<br><span class='text-span-2'>Skärmbild av FoundationGames</span>",
      "screenshottitle2": "Effektiv Entity Rendering",
      "screenshotdesc2": "Iris förbättrar sättet som Minecraft renderar entities och block entities som kistor, grisar, och föremålsramar. Detta funkar även med shaders inaktiverade, och i världar med många entities så kan det öka prestandan med upp till 60 procent jämfört med vanilla. Rendering av skuggor får en särskild förbättring vilket gör att områden som tidigare var ospelbara med shaders numera ger en förvånansvärt hög FPS!<br><span class='text-span-2'>Skärmbild av kinzuu_music</span>",
      "stillcurious": "Fortfarande nyfiken? <a href='about.html'>Läs vidare</a><link rel='prefetch' href='/about.html'>."
    },
    {
      "abouttitle": "Om IrisShaders",
      "heading": "Iris-projektet",
      "subheading": "Lär dig mer om Shader Sensationen",
      "aboutproject": "Om projektet",
      "messageheading": "Ett meddelande från grundaren och den ledande utvecklaren hos Iris Shaders",
      "message": "Iris utvecklades för att fylla ett hål jag såg i communityn för grafisk förbättring och anpassning i Minecraft: bristen av ett shaders mod med öppen källkod som låter mig använda mina favorit shader-paket med moderna versioner av spelet, medans det behåller prestanda och kompatibilitet med modpacks. OptiFine, det nuvarande dominanta modet för att använda shader-paket, har en restriktiv licens som står bestämt står i vägen för någon sorts mekande, och är relativt ökänt för att inte vara kompatibelt med mods som jag gillar. Det är också helt inkompatibelt med Sodium, det bästa renderings-optimerings mod som finns just nu med stor marginal. ShadersMod uppdaterades aldrig efter 1.12, och saknar stöd för många av de moderna och populära shader-paketen. Så jag skapade Iris, för att försöka lösa dess problem, och för att addressera flera andra långvariga problem med shader-paket.<br><br>Först och främst utvecklade jag Iris för att tillgodose mina egna behov av ett prestandaorienterat shader mod med god kompatibilitet och potential för mekande. Iris tillsammans med Sodium levererar lysande prestanda på min masking, vilket äntligen gör det möjligt för mig att faktiskt spela med shaders, istället för att bara aktivera dem för fina skärmbilder för att sedan inaktivera dem när jag blir trött på frame drops. Som det visar sig så är jag långt ifrån den enda som har nytta av utvecklingen av Iris, det är därför jag bestämt mig för att släppa Iris som et mod med öppen källkod<br><br>Iris har har en offentlig och stabil version för 1.16 som funkar med en anpassad version av Sodium, samt en offentlig betaversion för 1.17 som just nu inte funkar med Sodium (just nu finns ingen officiell version av Sodium för 1.17). Iris är fortfarande under kraftig utveckling, nya förbättringar kommer varje vecka och det utvecklas snabbt!",
      "performance": "Prestanda",
      "performanceheading": "Se hur din FPS ökar med Iris",
      "vanilla": "Endast Vanilla",
      "vanillamessage": "Vanilla Minecraft har en väldigt gammal kodbas, och många säger att den verkligen skulle behöva skrivas om, särskilt när det kommer till grafik. Blaze 3D rendering, tillagt i 1.15, var ett försök att lindra detta något, men på många sätt gjorde det bara problemet värre. I 1.17 så flyttat Minecraft till OpenGL Core 3.2 samt Java 16, men än så länge har inga betydande ändringar implementerats för att utnyttja prestandaökningen av dessa system. Minecraft före 1.17 hade inte inbyggt stöd för shader, och även efter 1.17 så är stödet väldigt begränsat. Minecraft är dock känt för sin minimalistiska grafik, och har en stark grund för shaderbaserad grafik med hög prestanda.",
      "sodium": "Vanilla + <span class='text-span-4'>Sodium</span>",
      "sodiummessage": "Sodium är ett fabric mod som skriver om delar av det ursprungliga renderingssystemet för att optimera prestanda på ett sätt som inget annat mod gjort förut. Sodium underhålls och uppdateras aktivt, och har som mål att vara kompatibelt med de flesta andra Fabric mods för maximal FPS i även de mest packade mod-paket. Dess syskonmod, Lithium, Phosphor, och Hydrogen, kan användar vid sidan om Sodium för att optimera olika aspekter av spelet, så som ticking, belysning, respektive minne. Tillsamans kan dessa mods öka FPS med 150% eller mer över vanillas prestanda för vilken spelare som helst, oavsett om du siktar på att ha så hög FPS som möjligt eller om dessa mods är det enda som gör att du kan spela med den hårdvara du har tillgänglig.",
      "sodiumiris": "Vanilla + <span class='text-span-4'>Sodium</span> + <span class='text-span-3'>Iris</span>",
      "sodiumirismessage": "Iris bygger på både Sodium samt Vanilla för att erbjuda något som inget annat fristående fabric mod gjort förut: stöd för befintliga existerande shaders. Och eftersom Iris jobbar tillsammans med Sodium och Vanilla så kan du få shaders med utmärkta frame rates, utan att behöva dyr hårdvara eller experimentella spelmodifikationer. De extra processer som iris utför minskar endast prestandan med 10 till 15 procent, och med Sodium installerat så ligger prestandanr väl över vanilla. I framtiden så kommer Iris vara fullt integrerat, och kommer till och med bidra med egen renderingsoptimering, så att Iris och Sodium kan jobba tillsammans för att vara bättre än vad de kan vara var för sig. Och dessa prestandaförbättringar överförs direkt till shaders, då de flesta populära shaders kör vid eller över 60 fps, även på hårdvara som är 5 eller 6 år gammal!",
      "screenshot": "Skärmbildsgalleri",
      "screenshotsubheading": "Se vad iris kan erbjuda",
      "screenshot1": "Bild av Guardian med SEUS v11",
      "screenshot2": "Bild av Guardian med Sildurs Extreme VL",
      "screenshot3": "Bild av FoundationGames med Complementary",
      "screenshot4": "Bild av IMS med Sildurs Vibrant Extreme VL",
      "screenshot5": "Bild av IMS med BSL v8",
      "screenshot6": "Bild av IMS med Complementary v4.0",
      "screenshot7": "Bild av IMS med Complementary v4.0",
      "screenshot8": "Bild av IMS med SEUS Renewed",
      "screenshot9": "Bild av IMS med Complementary v4.0",
      "screenshot10": "Bild av IMS med Complementary v4.0",
      "screenshot11": "Bild av kinzuu_music med Complementary v4.0",
      "screenshot12": "Bild av Justsnoopy30 med Complementary v4.0 BE",
      "note": "Notera - BE indikerar skärmbilder med innehåll från BetterEnd modet av paulevs"
    },
    {
      "downloadiris": "Ladda ner Nu - IrisShaders",
      "heading": "Irisinstalleraren",
      "subheading": "designad för att underlätta din Iris-upplevelse",
      "description": "Irisinstalleraren kommer automatisk ladda ner och installera Iris och Sodium för fantastisk grafik med jämn frame rate. Kör helt enkelt installeraren, välj din version, och klicka installera. Tror du inte oss? Testa själv.",
      "downloadjar": "Ladda ner Universal JAR",
      "alternatedownloads": "Alternativa Nerladdningar",
      "alternatedownloadsubheading": "Är vår användbara installerar inte din stil? Testa den fristående versionen",
      "getmodrinth": "Ladda ner från Modrinth",
      "getcurseforge": "Ladda ner från CurseForge",
      "getgithub": "Få källkoden från GitHub"
    }
  ],
  "common": {
    "irisshaders": "Iris Shaders",
    "home": "Hem",
    "about": "Läs Mer",
    "download": "Ladda ner Nu",
    "dark": " Mörkt läge",
    "light": " Ljust läge",
    "footer1": "Om Irisprojektet",
    "footerdesc1": "Irisprojeket är ett sammarbetsfokuserat öppet projekt skapat av ett team av passionerade utvecklare som försöker göra Minecraft shaders upplevelsen så bra som den kan bli. Iris utvecklas av communityn, för communityn.",
    "footer2": "Användbara länkar",
    "curseforge": "Iris på CurseForge",
    "modrinth": "Iris på Modrinth",
    "github": "GitHub",
    "discord": "Discord",
    "patreon": "Patreon",
    "copyright": "© Copyright 2021 IrisShaders. All Rights Reserved."
  }
}
