{
  "data": [
    {
      "title": "Bu Iris",
      "subheading": "Minecraft grafiklerinin yeni çağına bir bakış",
      "or": "ve ya",
      "continue": "Devamını Oku",
      "heading1": "Neden Iris?",
      "subheading1": "İşte Iris'i farklı kılan şeyler",
      "card1": "Harika Mod Uyumluluğu",
      "carddesc1": "Iris, mod uyumluluğunu birinci öncelik olarak görmektedir ve zaten en sevdiğiniz birçok mod ile uyumludur!",
      "card2": "Modern Tasarım",
      "carddesc2": "Iris, genişletilebilir ve kolay güncellenebilir olacak şekilde baştan inşa edilmiştir. Yeni Minecraft sürümünde shader kullanmak için haftalarca beklemeye veda edin!",
      "card3": "Ücretsiz ve Açık Kaynak",
      "carddesc3": "Iris, herkesin katkıda bulunabileceği açık kaynaklı bir moddur. Bu, işbirliğini kolaylaştırarak Iris'in gelişmesine olanak tanır.",
      "heading2": "Özellikler",
      "subheading2": "Iris'in sundukları",
      "image1": "OptiFine Eşdeğeri",
      "imagedesc1": "Iris, geçmişte ve şu anda kullanılan tüm OptiFine shader paketleri için tam destek sağlamayı amaçlamaktadır ve Iris'in desteklediği paketlerin sayısı sürekli ve hızla artmaktadır!<span class='text-span-2'><br>Screenshot by IMS, Kappa v5</span>",
      "image2": "Sodium ile Çalışır",
      "imagedesc2": "Iris, Sodium ve Phosphor gibi CaffeineMC optimizasyon modlarıyla uyumludur ve vanilya ile karşılaştırılabilir veya daha iyi kare hızlarında muhteşem grafikler sağlar.<br><span class='text-span-2'>Screenshot by IMS, Nostalgia v4</span>",
      "heading3": "Iris Avantajı",
      "subheading3": "Sizi oyunun ilerisinde tutan yeni render teknikleri",
      "shadows": "Gölgeler",
      "entities": "Varlıklar",
      "screenshottitle1": "Performans Optimizasyonlu Gölgeler",
      "screenshotdesc1": "Iris, shader'ların en büyük performans yüklerinden biri olan gölgelerin yükünü azaltmak için Shadow Frustum Culling adlı bir teknik kullanır. Iris'in shadow frustum culling'i kullanarak, volumetrik aydınlatma veya gölgelerin kalitesinden ödün vermeden daha yüksek kare hızlarına ulaşabilirsiniz.<br><span class='text-span-2'>Screenshot by IMS, Kappa v5</span>",
      "screenshottitle2": "Verimli Varlık Render'lama",
      "screenshotdesc2": "Iris, Minecraft'ın varlıkları ve blok varlıkları (sandıklar, domuzlar ve eşya çerçeveleri gibi) render'lama şeklini geliştirir. Bu hile shader'lar devre dışı bırakıldığında bile çalışır ve çok sayıda varlığın bulunduğu dünyalarda, vanilya performansını %60'a kadar artırabilir. Gölgeleri render'lama, özellikle büyük bir gelişme sağlar ve shader'larla oynanamaz hale gelen alanlar, FPS'in şaşırtıcı derecede düzgün olduğu yerlere dönüşür!<br><span class='text-span-2'>Screenshot by kinzuu_music</span>",
      "stillcurious": "Hala meraklı mısınız? <a href='about.html'>Daha Fazla Bilgi Edinin</a><link rel='prefetch' href='/about.html'>."
    },
    {
      "abouttitle": "IrisShaders Hakkında",
      "heading": "Iris Projesi",
      "subheading": "Shader Sensation hakkında daha fazla bilgi edinin",
      "aboutproject": "Proje Hakkında",
      "messageheading": "Iris Shaders'ın kurucusu ve baş geliştiricisinden bir mesaj",
      "message": "Iris, Minecraft özelleştirme ve grafik iyileştirme topluluğunda gördüğüm bir boşluğu doldurmak için yaratıldı: modern oyun sürümlerinde favori shader paketlerimi yüklememe izin verecek, performansı ve mod paketleri ile uyumluluğu koruyacak açık kaynaklı bir shader modunun eksikliği. Şu anda shader paketlerini yüklemek için kullanılan dominant mod olan OptiFine, herhangi bir tür tinkering'e engel olan kısıtlayıcı lisanslamaya sahiptir ve sevdiğim modlarla uyumluluk sorunları yaşamasıyla oldukça kötü bir üne sahiptir. Ayrıca, var olan en iyi render optimizasyon modu olan Sodium ile karşılıklı olarak uyumsuzdur. ShadersMod 1.12'den öteye güncellenmedi ve birçok modern popüler shader paketi için destek sunmamaktadır. Bu yüzden Iris'i, bu sorunları çözmeye çalışmak ve shader paketleriyle ilgili diğer uzun süreli sorunları ele almak için yarattım.<br><br>Her şeyden önce, Iris'i kendi ihtiyaçlarımı karşılamak için, performans odaklı bir shader modu olarak geliştiriyorum. Sodium ile birlikte kullanıldığında, bilgisayarımda harika bir performans sunuyor ve shader'ları yalnızca güzel ekran görüntüleri almak için değil, sürekli olarak kullanmamı mümkün kılıyor. Tabii ki, Iris'in gelişiminden faydalanan tek kişi ben değilim, bu yüzden onu açık kaynaklı bir mod olarak halka sunmaya karar verdim.<br><br>Iris, 1.18.2, 1.19.2 ve 1.19.3 için halka açık stabil sürüme ve anlık görüntüler için halka açık beta sürüme sahiptir. Iris hala yoğun bir şekilde geliştiriliyor ve çok sık yeni iyileştirmeler alıyor, çok hızlı ilerliyor!",
      "performance": "Performans",
      "performanceheading": "Iris ile kare hızlarını görün",
      "vanilla": "Yalnızca Vanilya",
      "vanillamessage": "Mevcut Minecraft sürümünün çok eski bir kod tabanı var ve birçok kişi özellikle grafikler söz konusu olduğunda bir yeniden yazıma ihtiyaç duyduğunu söylüyor. 1.15'te eklenen Blaze 3D render'lama, bu sorunu biraz hafifletmeye çalıştı, ancak birçok açıdan sorunu daha da kötüleştirdi. 1.17'de, Minecraft OpenGL Core 3.2 ve Java 16'ya geçiyor, ancak şu ana kadar bu sistemlerin performans iyileştirmelerinden yararlanan önemli değişiklikler uygulanmadı. 1.17'den önce Minecraft shader'ları yerel olarak desteklemiyordu ve 1.17'den beri shader desteği çok sınırlı. Ancak, Minecraft düşük maliyetli minimalist grafiklerle bilinir ve yüksek performanslı shader tabanlı grafikler için sağlam bir temel sağlar.",
      "sodium": "Vanilya + <span class='text-span-4'>Sodium</span>",
      "sodiummessage": "Sodium, performansı optimize etmek için vanilya renderlama sisteminin bazı kısımlarını yeniden yazan bir fabric modudur ve bunu başka hiçbir modun yapmadığı şekilde yapar. Sodium, aktif olarak bakım ve güncellenmektedir ve en büyük mod paketlerinde bile maksimum FPS için çoğu diğer Fabric modları ile uyumlu olmayı hedefler. Kardeş modları, Lithium, Phosphor ve Hydrogen, sırasıyla oyun süresi, aydınlatma veya bellek gibi oyunun farklı yönlerini optimize etmek için Sodium ile birlikte kullanılabilir. Bu modlar birlikte, herhangi bir oyuncu için vanilya performansının %150'si veya daha fazlasına kadar FPS artırabilir, ister size PvP avantajı sağlayacak maksimum kare hızlarını hedefliyor olun, ister Sodium ve benzeri modlar mevcut donanımınızda oyunu oynanabilir hale getiren tek modlar olsun.",
      "sodiumiris": "Vanilya + <span class='text-span-4'>Sodium</span> + <span class='text-span-5'>Iris</span>",
      "sodiumirismessage": "Iris, daha önce hiçbir bağımsız fabric modunun sahip olmadığı bir şey sağlar: mevcut özel shader'lar için destek. Ve çünkü Iris, Sodium ve Vanilya ile bir araya geliyor, pahalı donanım veya deneysel oyun modifikasyonlarına gerek kalmadan dikkat çekici kare hızlarında shader'lar elde edebilirsiniz. Iris'in gerçekleştirdiği ek işlemler yalnızca performansı %10-15 oranında düşürür ve Sodium yüklü olduğunda performans vanilya performansının çok üzerinde kalır! Bu doğrudan shader'lara da yansır, çoğu popüler shader, 5-6 yıllık donanımlarda bile tutarlı bir şekilde 60 fps veya daha üzerinde çalışır!",
      "screenshot": "Ekran Görüntüsü Galerisi",
      "screenshotsubheading": "Iris'in sunduklarını görün",
      "screenshot1": "Guardian tarafından SEUS v11 kullanılarak yakalandı",
      "screenshot2": "Guardian tarafından Sildurs Extreme VL kullanılarak yakalandı",
      "screenshot3": "FoundationGames tarafından Complementary kullanılarak yakalandı",
      "screenshot4": "IMS tarafından Sildurs Vibrant Extreme VL kullanılarak yakalandı",
      "screenshot5": "IMS tarafından BSL v8 kullanılarak yakalandı",
      "screenshot6": "IMS tarafından Complementary v4.0 kullanılarak yakalandı",
      "screenshot7": "IMS tarafından Complementary v4.0 kullanılarak yakalandı",
      "screenshot8": "IMS tarafından SEUS Renewed kullanılarak yakalandı",
      "screenshot9": "IMS tarafından Complementary v4.0 kullanılarak yakalandı",
      "screenshot10": "IMS tarafından Complementary v4.0 kullanılarak yakalandı",
      "screenshot11": "kinzuu_music tarafından Complementary v4.0 kullanılarak yakalandı",
      "screenshot12": "Justsnoopy30 tarafından Complementary v4.0 BE kullanılarak yakalandı",
      "note": "Not - BE, paulevs tarafından oluşturulan BetterEnd modunu içeren ekran görüntülerini belirtir."
    },
    {
      "downloadiris": "Şimdi İndir - IrisShaders",
      "heading": "Iris Yükleyici",
      "subheading": "Iris deneyiminizi kolaylaştırmak için tasarlandı",
      "description": "Iris'in yükleyicisi, harika grafikler ve sorunsuz kare hızları için Iris ve Sodium'u otomatik olarak indirip yükleyecektir. Yükleyiciyi çalıştırın, sürümünüzü seçin ve yükle tuşuna basın. Bize inanmıyor musunuz? Kendiniz deneyin!",
      "downloadjar": "Evrensel JAR İndir",
      "alternatedownloads": "Alternatif İndirmeler",
      "alternatedownloadsubheading": "Kullanışlı Yükleyicimiz sizin tarzınız değil mi? Bağımsız sürümü deneyin",
      "getmodrinth": "Modrinth'den İndir",
      "getcurseforge": "CurseForge'dan İndir",
      "getgithub": "GitHub'dan Kaynağı Al"
    }
  ],
  "common": {
    "irisshaders": "Iris Shaders",
    "home": "Ana Sayfa",
    "about": "Daha Fazla Bilgi Edinin",
    "download": "Şimdi İndir",
    "dark": " Karanlık mod",
    "light": " Aydınlık mod",
    "footer1": "Iris projesi hakkında",
    "footerdesc1": "Iris Projesi, Minecraft shader deneyimini mümkün olan en iyi hale getirmeyi amaçlayan tutkulu geliştiricilerden oluşan bir ekip tarafından oluşturulmuş ortak bir açık kaynak projesidir. Iris, topluluk tarafından ve topluluk için geliştirilmiştir.",
    "footer2": "Faydalı bağlantılar",
    "curseforge": "Iris CurseForge'da",
    "modrinth": "Iris Modrinth'de",
    "github": "GitHub",
    "discord": "Discord",
    "patreon": "Patreon",
    "copyright": "© Telif Hakkı 2024. LGPLv3 altında lisanslanmıştır."
  }
}
